[
  {
    "part": "PartOne",
    "articleNumber": 1,
    "articleTitle": "Constitution as the fundamental law",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "This Constitution is the fundamental law of Nepal. Any law inconsistent with this Constitution shall, to the extent of such inconsistency, be void."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "It shall be the duty of every person to observe this Constitution."
      }
    ]
  },
  {
    "part": "PartOne",
    "articleNumber": 2,
    "articleTitle": "Sovereignty and state authority",
    "articleDescription": "The sovereignty and state authority of Nepal shall be vested in the Nepalese people. It shall be exercised in accordance with the provisions set forth in this Constitution."
  },
  {
    "part": "PartOne",
    "articleNumber": 3,
    "articleTitle": "Nation",
    "articleDescription": "All the Nepalese people, with multiethnic, multilingual, multi-religious, multicultural characteristics and in geographical diversities, and having common aspirations and being united by a bond of allegiance to national independence, territorial integrity, national interest and prosperity of Nepal, collectively constitute the nation."
  },
  {
    "part": "PartOne",
    "articleNumber": 4,
    "articleTitle": "State of Nepal",
    "articleExplanation": "For the purposes of this Article, 'secular' means religious, cultural freedoms, including protection of religion, culture handed down from the time immemorial.",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Nepal is an independent, indivisible, sovereign, secular, inclusive, democratic, socialism-oriented, federal democratic republican state."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The territory of Nepal shall comprise:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "the territory existing at the time of commencement of this Constitution, and"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "such other territory as may be acquired after the commencement of this Constitution."
          }
        ]
      }
    ]
  },
  {
    "part": "PartOne",
    "articleNumber": 5,
    "articleTitle": "National interest",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Safeguarding of the freedom, sovereignty, territorial integrity, nationality, independence and dignity of Nepal, the rights of the Nepalese people, border security, economic wellbeing and prosperity shall be the basic elements of the national interest of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Any conduct and act contrary to the national interest shall be punishable by the Federal law."
      }
    ]
  },
  {
    "part": "PartOne",
    "articleNumber": 6,
    "articleTitle": "Languages of the nation",
    "articleDescription": "All languages spoken as the mother tongues in Nepal are the languages of the nation."
  },
  {
    "part": "PartOne",
    "articleNumber": 7,
    "articleTitle": "Official language",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Nepali language in the Devnagari script shall be the official language of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A State may, by a State law, determine one or more than one languages of the nation spoken by a majority of people within the State as its official language(s), in addition to the Nepali language."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Other matters relating to language shall be as decided by the Government of Nepal, on recommendation of the Language Commission."
      }
    ]
  },
  {
    "part": "PartOne",
    "articleNumber": 8,
    "articleTitle": "National flag",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The national flag of Nepal consists of two juxtaposed triangular figures with a crimson-coloured base and deep blue borders, there being a white emblem of the crescent moon with eight rays visible out of sixteen in the upper part and a white emblem of a twelve rayed sun in the lower part."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The method of drawing out the flag and other particulars relating thereto shall be as set forth in Schedule-1."
      }
    ]
  },
  {
    "part": "PartOne",
    "articleNumber": 9,
    "articleTitle": "National anthem etc",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The national anthem of Nepal shall be as set forth in Schedule-2."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The coat-of-arms of Nepal shall be as set forth in Schedule-3."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The Rhododendron Arboreum shall be the national flower, Crimson Colour shall be the national colour, the Cow shall be the national animal and the Lophophorus shall be the national bird of Nepal."
      }
    ]
  },
  {
    "part": "PartTwo",
    "articleNumber": 10,
    "articleTitle": "Not to deprive of citizenship",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No citizen of Nepal may be deprived of the right to obtain citizenship."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "There is a provision of single federal citizenship with State identity in Nepal."
      }
    ]
  },
  {
    "part": "PartTwo",
    "articleNumber": 11,
    "articleTitle": "To be citizens of Nepal",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The persons who have obtained the citizenship of Nepal at the time of commencement of this Constitution and who are qualified to obtain citizenship in accordance with this Part shall be the citizens of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The following person who has his or her permanent domicile in Nepal at the time of commencement of this Constitution shall be the citizen of Nepal by descent:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "a person who has obtained the citizenship of Nepal by descent prior to the commencement of this Constitution,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "a person whose father or mother was a citizen of Nepal at his or her birth."
          }
        ]
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "A child of a citizen having obtained the citizenship of Nepal by birth prior to the commencement of Nepal shall, upon attaining majority, acquire the citizenship of Nepal by descent if the child's father and mother both are citizens of Nepal."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Every minor who is found within Nepal and the whereabouts of whose father and mother are not known shall, until the father or the mother of the child is traced, be a citizen of Nepal by descent."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "A person who is born in Nepal from a woman who is a citizen of Nepal and has resided in Nepal and whose father is not traced shall be provided with the citizenship of Nepal by descent.",
        "clauseExtraInfo": "Provided that his or her father is held to be a foreign citizen, the citizenship of such person shall be converted into naturalized citizenship as provided for in the Federal law."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "A foreign woman who has a matrimonial relationship with a citizen of Nepal may, if she so wishes, acquire the naturalized citizenship of Nepal as provided for in the Federal law."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "Notwithstanding anything contained elsewhere in this Article, in the case of a person born from a woman who is a citizen of Nepal and married to a foreign citizen, the person may acquire the naturalized citizenship of Nepal in accordance with the Federal law if he or she has permanently resided in Nepal and has not acquired the citizenship of a foreign country.",
        "clauseExtraInfo": "Provided that if such person's mother and father both are citizens of Nepal at the time of acquisition of citizenship, such person born in Nepal may acquire the citizenship of Nepal by descent."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "In the cases other than those mentioned in this Article, the Government of Nepal may, in accordance with the Federal law, grant the naturalized citizenship of Nepal."
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "The Government of Nepal may, in accordance with the Federal law, grant the honorary citizenship of Nepal."
      },
      {
        "clauseNumber": 10,
        "clauseDescription": "Whenever any territory is acquired by way of merger into Nepal, a person having his or her domicile in such territory shall become a citizen of Nepal, subject to the Federal law."
      }
    ]
  },
  {
    "part": "PartTwo",
    "articleNumber": 12,
    "articleTitle": "Citizenship with identity of descent and gender",
    "articleDescription": "A person who obtains the citizenship of Nepal by descent in accordance with this Constitution may obtain a certificate of citizenship of Nepal with gender identity by the name of his or her mother or father."
  },
  {
    "part": "PartTwo",
    "articleNumber": 13,
    "articleTitle": "Acquisition, reacquisition and termination of citizenship",
    "articleDescription": "Other matters relating to the acquisition, reacquisition and termination of citizenship shall be as provided for in the Federal law."
  },
  {
    "part": "PartTwo",
    "articleNumber": 14,
    "articleTitle": "Power to grant non-resident Nepalese citizenship",
    "articleDescription": "The non-residential citizenship of Nepal may be so granted to a person who has acquired the citizenship of a foreign country, has resided in a country other than a member state of the South Asian Association for Regional Cooperation, and who or whose father or mother, grandfather or grandmother was previously a citizen of Nepal by decent or birth but subsequently acquired the citizenship of the foreign country that such person may enjoy economic, social and cultural rights in accordance with the Federal law."
  },
  {
    "part": "PartTwo",
    "articleNumber": 15,
    "articleTitle": "Other provisions relating to citizenship of Nepal",
    "articleDescription": "Other matters relating to the maintenance of records setting out the identity of every citizen of Nepal and the citizenship of Nepal shall be as provided for in the Federal law."
  },
  {
    "part": "PartThree",
    "articleNumber": 16,
    "articleTitle": "Right to live with dignity",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every person shall have the right to live with dignity."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No law shall be made providing for the death penalty to any one."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 17,
    "articleTitle": "Right to freedom",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No person shall be deprived of his or her personal liberty except in accordance with law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Every citizen shall have the following freedoms:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "freedom of opinion and expression,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "freedom to assemble peaceably and without arms,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "freedom to form political parties,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "freedom to form unions and associations,"
          },
          {
            "subClauseLabel": "E",
            "subClauseDescription": "freedom to move and reside in any part of Nepal,"
          },
          {
            "subClauseLabel": "F",
            "subClauseDescription": "freedom to practice any profession, carry on any occupation, and establish and operate any industry, trade and business in any part of Nepal."
          }
        ],
        "clauseExtraInfo": [
          {
            "extraNumber": 1,
            "extraDescription": "Nothing in sub-clause (A) shall be deemed to prevent the making of an Act to impose reasonable restrictions on any act which may undermine the sovereignty, territorial integrity, nationality and independence of Nepal or the harmonious relations between the Federal Units or the people of various castes, tribes, religions or communities or incite caste-based discrimination or untouchability or on any act of disrespect of labour, defamation, contempt of court, incitement to an offence or on any act which may be contrary to public decency or morality."
          },
          {
            "extraNumber": 2,
            "extraDescription": "Nothing in sub-clause (B) shall be deemed to prevent the making of an Act to impose reasonable restrictions on any act which may undermine the sovereignty, territorial integrity, nationality and independence of Nepal or the harmonious relations between the Federal Units or public peace and order."
          },
          {
            "extraNumber": 3,
            "extraDescription": "Nothing in sub-clause (C) shall be deemed to prevent the making of an Act to impose reasonable restrictions on any act which may undermine the sovereignty, territorial integrity, nationality and independence of Nepal, constitute an espionage against the nation or divulge national secrecy or on any act of rendering assistance to any foreign state, organization or representative in a manner to undermine the security of Nepal or on an act of sedition or on any act which may undermine the harmonious relations between the Federal Units or on any act of incitement to caste-based or communal hatred or on any act which may undermine the harmonious relations between various castes, tribes, religions and communities, or on any act of acquisition of, or restriction on, membership of any political party on the basis solely of tribe, language, religion, community or sex or on any act of formation of a political party with discrimination between citizens or on incitement to violent acts or on any act which may be contrary to public morality."
          },
          {
            "extraNumber": 4,
            "extraDescription": "Nothing in sub-clause (D) shall be deemed to prevent the making of an Act to impose reasonable restrictions on any act which may undermine the sovereignty, territorial integrity, nationality and independence of Nepal, or on any act which may constitute espionage against the nation or on any act of divulgence of national secrecy or on any act assisting any foreign state, organization or representative in a manner to undermine the security of Nepal or on an act of sedition or on any act which may undermine the harmonious relations between the Federal Units or on any act of incitement to caste-based or communal hatred or on any act which may undermine the harmonious relations between various castes, tribes, religions and communities or on incitement to violent acts or on any act which may be contrary to public morality."
          },
          {
            "extraNumber": 5,
            "extraDescription": "Nothing in sub-clause (E) shall be deemed to prevent the making of an Act to impose reasonable restrictions on any act which may undermine the interest of the general public or which may undermine the harmonious relations between the Federal Units or the harmonious relations between the peoples of various castes, tribes, religions or communities or which may constitute or incite violent acts."
          },
          {
            "extraNumber": 6,
            "extraDescription": "Nothing in sub-clause (F) shall be deemed to prevent the making of an Act to prevent any act which may undermine the harmonious relations between the Federal Units or any act which may be contrary to public health, decency or morality of the general public or to confer on the State the exclusive right to undertake any specific industry, trade or service, or to prescribe any condition or qualification for carrying on any industry, trade, occupation, employment or business."
          }
        ]
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 18,
    "articleTitle": "Right to equality",
    "articleExplanation": "For the purposes of this Part and Part 4, 'indigent' means a person who earns income less than that specified by the Federal law.",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "All citizens shall be equal before law. No person shall be denied the equal protection of law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No discrimination shall be made in the application of general laws on grounds of origin, religion, race, caste, tribe, sex, physical condition, condition of health, marital status, pregnancy, economic condition, language or region, ideology or on similar other grounds."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The State shall not discriminate citizens on grounds of origin, religion, race, caste, tribe, sex, economic condition, language, region, ideology or on similar other grounds.",
        "clauseExtraInfo": "Provided that nothing shall be deemed to prevent the making of special provisions by law for the protection, empowerment or development of the citizens including the socially or culturally backward women, Dalit, indigenous people, indigenous nationalities, Madhesi, Tharu, Muslim, oppressed class, Pichhada class, minorities, the marginalized, farmers, labours, youths, children, senior citizens, gender and sexual minorities, persons with disabilities, persons in pregnancy, incapacitated or helpless, backward region and indigent Khas Arya."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 19,
    "articleTitle": "Right to communication",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No publication and broadcasting or dissemination or printing of any news item, editorial, feature article or other reading, audio and audio-visual material through any means whatsoever including electronic publication, broadcasting and printing shall be censored.",
        "clauseExtraInfo": "Provided that nothing shall be deemed to prevent the making of Acts to impose reasonable restrictions on any act which may undermine the sovereignty, territorial integrity, nationality of Nepal or the harmonious relations between the Federal Units or the harmonious relations between various castes, tribes, religions or communities, or on any act of sedition, defamation or contempt of court or incitement to an offence, or on any act which may be contrary to public decency or morality, on any act of hatred to labour and on any act of incitement to caste-based untouchability as well as gender discrimination."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No radio, television, on-line or other form of digital or electronic equipment, press or other means of communication publishing, broadcasting or printing any news item, feature, editorial, article, information or other material shall be closed or seized nor shall registration thereof be cancelled nor shall such material be seized by the reason of publication, broadcasting or printing of such material through any audio, audio-visual or electronic equipment.",
        "clauseExtraInfo": "Provided that nothing contained in this clause shall be deemed to prevent the making of an Act to regulate radio, television, online or any other form of digital or electronic equipment, press or other means of communication."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "No means of communication including the press, electronic broadcasting and telephone shall be interrupted except in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 20,
    "articleTitle": "Rights relating to justice",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No person shall be detained in custody without informing him or her of the ground for his or her arrest."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Any person who is arrested shall have the right to consult a legal practitioner of his or her choice from the time of such arrest and to be defended by such legal practitioner. Any consultation made by such person with, and advice given by, his or her legal practitioner shall be confidential.",
        "clauseExtraInfo": "Provided this clause shall not apply to a citizen of an enemy state.",
        "clauseExplanation": "For the purpose of this clause, 'legal practitioner' means any person who is authorized by law to represent any person in any court."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Any person who is arrested shall be produced before the adjudicating authority within a period of twenty-four hours of such arrest, excluding the time necessary for the journey from the place of arrest to such authority; and any such person shall not be detained in custody except on the order of such authority.",
        "clauseExtraInfo": "Provided that this clause shall not apply to a person held in preventive detention and to a citizen of an enemy state."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "No person shall be liable for punishment for an act which was not punishable by the law in force when the act was committed nor shall any person be subjected to a punishment greater than that prescribed by the law in force at the time of the commission of the offence."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Every person charged with an offence shall be presumed innocent until proved guilty of the offence."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "No person shall be tried and punished for the same offence in a court more than once."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "No person charged with an offence shall be compelled to testify against himself or herself."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "Every person shall have the right to be informed of any proceedings taken against him or her."
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "Every person shall have the right to a fair trial by an independent, impartial and competent court or judicial body."
      },
      {
        "clauseNumber": 10,
        "clauseDescription": "Any indigent party shall have the right to free legal aid in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 21,
    "articleTitle": "Right of victim of crime",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A victim of crime shall have the right to get information about the investigation and proceedings of a case in which he or she is the victim."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A victim of crime shall have the right to justice including social rehabilitation and compensation in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 22,
    "articleTitle": "Right against torture",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No person who is arrested or detained shall be subjected to physical or mental torture or to cruel, inhuman or degrading treatment."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Any act mentioned in clause (1) shall be punishable by law, and any person who is the victim of such treatment shall have the right to obtain compensation in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 23,
    "articleTitle": "Right against preventive detention",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No person shall be held under preventive detention unless there is a sufficient ground of the existence of an immediate threat to the sovereignty, territorial integrity or public peace and order of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Information about the situation of a person who is held under preventive detention pursuant to clause (1) must be given immediately to his or her family members or relatives.",
        "clauseExtraInfo": "Provided that this clause shall not apply to a citizen of an enemy state."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If the authority making preventive detention holds any person under preventive detention contrary to law or in bad faith, the person held under preventive detention shall have the right to obtain compensation in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 24,
    "articleTitle": "Right against untouchability and discrimination",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No person shall be subjected to any form of untouchability or discrimination in any private and public places on grounds of his or her origin, caste, tribe, community, profession, occupation or physical condition."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "In producing or distributing any goods, services or facilities, no person belonging to any particular caste or tribe shall be prevented from purchasing or acquiring such goods, services or facilities nor shall such goods, services or facilities be sold, distributed or provided only to the persons belonging to any particular caste or tribe."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "No act purporting to demonstrate any person or community as superior or inferior on grounds of origin, caste, tribe or physical condition or justifying social discrimination on grounds of caste, tribe or untouchability or propagating ideology based on untouchability and caste based superiority or hatred or encouraging caste-based discrimination in any manner whatsoever shall be allowed."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "No discrimination in any form shall be allowed at a workplace with or without making untouchability on the ground of caste."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Any act of untouchability and discrimination in any form committed in contravention of this Article shall be punishable by law as a severe social offence, and the victim of such act shall have the right to obtain compensation in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 25,
    "articleTitle": "Right relating to property",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every citizen shall, subject to law, have the right to acquire, own, sell, dispose, acquire business profits from, and otherwise deal with, property.",
        "clauseExtraInfo": "Provided that the State may levy tax on property of a person, and tax on income of a person in accordance with the concept of progressive taxation.",
        "clauseExplanation": "For the purposes of this Article, 'property' means any form of property including movable and immovable property, and includes an intellectual property right."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The State shall not, except for public interest, requisition, acquire, or otherwise create any encumbrance on, property of a person.",
        "clauseExtraInfo": "Provided that this clause shall not apply to any property acquired by any person illicitly."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The basis of compensation to be provided and procedures to be followed in the requisition by the State of property of any person for public interest in accordance with clause (3) shall be as provided for in the Act."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The provisions of clauses (2) and (3) shall not prevent the State from making land reforms, management and regulation in accordance with law for the purposes of enhancement of product and productivity of lands, modernization and commercialization of agriculture, environment protection and planned housing and urban development."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Nothing shall prevent the State from using the property of any person, which it has requisitioned for public interest in accordance with clause (3), for any other public interest instead of such public interest."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 26,
    "articleTitle": "Right to freedom of religion",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every person who has faith in religion shall have the freedom to profess, practice and protect his or her religion according to his or her conviction."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Every religious denomination shall have the right to operate and protect its religious sites and religious Guthi (trusts).",
        "clauseExtraInfo": "Provided that nothing shall be deemed to prevent the regulation, by making law, of the operation and protection of religious sites and religious trusts and management of trust properties and lands."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "No person shall, in the exercise of the right conferred by this Article, do, or cause to be done, any act which may be contrary to public health, decency and morality or breach public peace, or convert another person from one religion to another or any act or conduct that may jeopardize other's religion."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 27,
    "articleTitle": "Right to information",
    "articleDescription": "Every citizen shall have the right to demand and receive information on any matter of his or her interest or of public interest.",
    "articleExtraInfo": "Provided that no one shall be compelled to provide information on any matter of which confidentiality must be maintained in accordance with law."
  },
  {
    "part": "PartThree",
    "articleNumber": 28,
    "articleTitle": "Right to privacy",
    "articleDescription": "The privacy of any person, his or her residence, property, document, data, correspondence and matters relating to his or her character shall, except in accordance with law, be inviolable."
  },
  {
    "part": "PartThree",
    "articleNumber": 29,
    "articleTitle": "Right against exploitation",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every person shall have the right against exploitation."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No person shall be exploited in any manner on the grounds of religion, custom, tradition, usage, practice or on any other grounds."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "No one shall be subjected to trafficking nor shall one be held in slavery or servitude."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "No one shall be forced to work against his or her will.",
        "clauseExtraInfo": "Provided that nothing shall be deemed to prevent the making of law empowering the State to require citizens to perform compulsory service for public purposes."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Act contrary to clauses (3) and (4) shall be punishable by law and the victim shall have the right to obtain compensation from the perpetrator in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 30,
    "articleTitle": "Right to clean environment",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every citizen shall have the right to live in a clean and healthy environment."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The victim shall have the right to obtain compensation, in accordance with law, for any injury caused from environmental pollution or degradation."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "This Article shall not be deemed to prevent the making of necessary legal provisions for a proper balance between the environment and development, in development works of the nation."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 31,
    "articleTitle": "Right relating to education",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every citizen shall have the right of access to basic education."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Every citizen shall have the right to get compulsory and free education up to the basic level and free education up to the secondary level from the State."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The citizens with disabilities and the economically indigent citizens shall have the right to get free higher education in accordance with law."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The visually impaired citizens shall have the right to get free education through brail script and the citizens with hearing or speaking impairment, to get free education through sign language, in accordance with law."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Every Nepalese community residing in Nepal shall have the right to get education in its mother tongue and, for that purpose, to open and operate schools and educational institutes, in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 32,
    "articleTitle": "Right to language and culture",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every person and community shall have the right to use their languages."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Every person and community shall have the right to participate in the cultural life of their communities."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Every Nepalese community residing in Nepal shall have the right to preserve and promote its language, script, culture, cultural civilization and heritage."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 33,
    "articleTitle": "Right to employment",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every citizen shall have the right to employment. The terms and conditions of employment, and unemployment benefit shall be as provided for in the Federal law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Every citizen shall have the right to choose employment."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 34,
    "articleTitle": "Right to labour",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every labourer shall have the right to practice appropriate labour.",
        "clauseExplanation": "For the purposes of this Article, 'labourer' means a labourer or worker who does physical or mental work for an employer in consideration for remuneration."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Every labourer shall have the right to appropriate remuneration, facilities and contributory social security."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Every labourer shall have the right to form and join trade unions and to engage in collective bargaining, in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 35,
    "articleTitle": "Right relating to health",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every citizen shall have the right to free basic health services from the State, and no one shall be deprived of emergency health services."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Every person shall have the right to get information about his or her medical treatment."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Every citizen shall have equal access to health services."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Every citizen shall have the right of access to clean drinking water and sanitation."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 36,
    "articleTitle": "Right relating to food",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every citizen shall have the right relating to food."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Every citizen shall have the right to be safe from the state of being in danger of life from the scarcity of food."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Every citizen shall have the right to food sovereignty in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 37,
    "articleTitle": "Right to housing",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every citizen shall have the right to an appropriate housing."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No citizen shall be evicted from the residence owned by him or her nor shall his or her residence be infringed except in accordance with law"
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 38,
    "articleTitle": "Rights of women",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every woman shall have equal lineage right without gender based discrimination."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Every woman shall have the right to safe motherhood and reproductive health."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "No woman shall be subjected to physical, mental, sexual, psychological or other form of violence or exploitation on grounds of religion, social, cultural tradition, practice or on any other grounds. Such act shall be punishable by law, and the victim shall have the right to obtain compensation in accordance with law."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Women shall have the right to participate in all bodies of the State on the basis of the principle of proportional inclusion."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Women shall have the right to obtain special opportunity in education, health, employment and social security, on the basis of positive discrimination."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The spouse shall have the equal right to property and family affairs."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 39,
    "articleTitle": "Rights of the child",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every child shall have the right to name and birth registration along with his or her identity."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Every child shall have the right to education, health, maintenance, proper care, sports, entertainment and overall personality development from the families and the State."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Every child shall have the right to elementary child development and child participation."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "No child shall be employed to work in any factory, mine or engaged in similar other hazardous work."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "No child shall be subjected to child marriage, transported illegally, abducted/kidnapped or taken in hostage."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "No child shall be recruited or used in army, police or any armed group, or be subjected, in the name of cultural or religious traditions, to abuse, exclusion or physical, mental, sexual or other form of exploitation or improper use by any means or in any manner."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "No child shall be subjected to physical, mental or any other form of torture in home, school or other place and situation whatsoever."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "Every child shall have the right to juvenile friendly justice."
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "The child who is helpless, orphan, with disabilities, conflict victim, displaced or vulnerable shall have the right to special protection and facilities from the State."
      },
      {
        "clauseNumber": 10,
        "clauseDescription": "Any act contrary to in clauses (4), (5), (6) and (7) shall be punishable by law, and a child who is the victim of such act shall have the right to obtain compensation from the perpetrator, in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 40,
    "articleTitle": "Rights of Dalit",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Dalit shall have the right to participate in all bodies of the State on the basis of the principle of proportional inclusion. Special provision shall be made by law for the empowerment, representation and participation of the Dalit community in public services as well as other sectors of employment."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Provision of free education with scholarship, from primary to higher education, shall be made by law for the Dalit students. Special provision shall be made by law for the Dalit in technical and vocational education."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Special provision shall be made by law in order to provide health and social security to the Dalit community."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The Dalit community shall have the right to use, protect and develop their traditional occupation, knowledge, skill and technology. The State shall accord priority to the Dalit community in modern business related with their traditional occupation and provide skills and resources required therefor."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "The State shall once provide land to the landless Dalit in accordance with law."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The State shall, in accordance with law, arrange settlement for the Dalit who do not have housing."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "The facilities conferred by this Article to the Dalit community must be distributed in a just manner so that the Dalit women, men and Dalit in all communities can obtain such facilities proportionately."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 41,
    "articleTitle": "Rights of senior citizens",
    "articleDescription": "The senior citizens shall have the right to special protection and social security from the State."
  },
  {
    "part": "PartThree",
    "articleNumber": 42,
    "articleTitle": "Right to social justice",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The socially backward women, Dalit, indigenous people, indigenous nationalities, Madhesi, Tharu, minorities, persons with disabilities, marginalized communities, Muslims, backward classes, gender and sexual minorities, youths, farmers, labourers, oppressed or citizens of backward regions and indigent Khas Arya shall have the right to participate in the State bodies on the basis of inclusive principle."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The indigent citizens and citizens of the communities on the verge of extinction shall have the right to get special opportunities and benefits in education, health, housing, employment, food and social security for their protection, upliftment, empowerment and development."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The citizens with disabilities shall have the right to live with dignity and honour, with the identity of their diversity, and have equal access to public services and facilities."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Every farmer shall have the right to have access to lands for agro activities, select and protect local seeds and agro species which have been used and pursued traditionally, in accordance with law."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "The families of the martyrs who have sacrificed their life, persons who were forced to disappear, and those who became disabled and injured in all popular movements, armed conflicts and revolutions that have been carried out for progressive democratic changes in Nepal, democracy fighters, conflict victims and displaced ones, persons with disabilities, the injured and victims shall have the right to get a prioritized opportunity, with justice and due respect, in education, health, employment, housing and social security, in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 43,
    "articleTitle": "Right to social security",
    "articleDescription": "The indigent citizens, incapacitated and helpless citizens, helpless single women, citizens with disabilities, children, citizens who cannot take care themselves and citizens belonging to the tribes on the verge of extinction shall have the right to social security, in accordance with law."
  },
  {
    "part": "PartThree",
    "articleNumber": 44,
    "articleTitle": "Rights of the consumer",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Every consumer shall have the right to obtain quality goods and services."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A person who has suffered injury from any substandard goods or services shall have the right to obtain compensation in accordance with law."
      }
    ]
  },
  {
    "part": "PartThree",
    "articleNumber": 45,
    "articleTitle": "Right against exile",
    "articleDescription": "No citizen shall be exiled."
  },
  {
    "part": "PartThree",
    "articleNumber": 46,
    "articleTitle": "Right to constitutional remedies",
    "articleDescription": "There shall be a right to obtain constitutional remedies in the manner set forth in Article 133 or 144 for the enforcement of the rights conferred by this Part."
  },
  {
    "part": "PartThree",
    "articleNumber": 47,
    "articleTitle": "Implementation of fundamental rights",
    "articleDescription": "The State shall, as required, make legal provisions for the implementation of the rights conferred by this Part, within three years of the commencement of this Constitution."
  },
  {
    "part": "PartThree",
    "articleNumber": 48,
    "articleTitle": "Duties of citizens",
    "articleDescription": "Every citizen shall have the following duties:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "to safeguard the nationality, sovereignty and integrity of Nepal, while being loyal to the nation,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "to abide by the Constitution and law,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "to render compulsory service as and when the State so requires,"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "to protect and preserve public property."
      }
    ]
  },
  {
    "part": "PartFour",
    "articleNumber": 49,
    "articleTitle": "To be guiding principles",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The directive principles, policies and obligations set forth in this Part shall be the guiding principles for the governance of the State."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The State shall mobilize, or cause to be mobilized, means and resources, as required, to implement the principles, policies and obligations set forth in this Part."
      }
    ]
  },
  {
    "part": "PartFour",
    "articleNumber": 50,
    "articleTitle": "Directive principles",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The political objective of the State shall be to establish a public welfare system of governance, by establishing a just system in all aspects of the national life through the rule of law, values and norms of fundamental rights and human rights, gender equality, proportional inclusion, participation and social justice, while at the same time protecting the life, property, equality and liberties of the people, in keeping with the vitality of freedom, sovereignty, territorial integrity and independence of Nepal, and to consolidate a federal democratic republican system of governance in order to ensure an atmosphere conducive to the enjoyment of the fruits of democracy, while at the same time maintaining the relations between the Federal Units on the basis of cooperative federalism and incorporating the principle of proportional participation in the system of governance on the basis of local autonomy and decentralization."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The social and cultural objective of the State shall be to build a civilized and egalitarian society by eliminating all forms of discrimination, exploitation and injustice on the grounds of religion, culture, tradition, usage, custom, practice or on any other similar grounds, to develop social, cultural values founded on national pride, democracy, pro-people, respect of labour, entrepreneurship, discipline, dignity and harmony, and to consolidate the national unity by maintaining social cohesion, solidarity and harmony, while recognizing cultural diversity."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The economic objective of the State shall be to achieve a sustainable economic development, while achieving rapid economic growth, by way of maximum mobilization of the available means and resources through participation and development of public, private and cooperatives, and to develop a socialism-oriented independent and prosperous economy while making the national economy independent, self-reliant and progressive in order to build an exploitation free society by abolishing economic inequality through equitable distribution of the gains."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The State shall direct its international relations towards enhancing the dignity of the nation in the world community by maintaining international relations on the basis of sovereign equality, while safeguarding the freedom, sovereignty, territorial integrity and independence and national interest of Nepal."
      }
    ]
  },
  {
    "part": "PartFour",
    "articleNumber": 51,
    "articleTitle": "Policies of the State",
    "articleDescription": "The State shall pursue the following policies:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "Policies relating to national unity and national security:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to keep intact the national unity, while protecting the freedom, sovereignty, territorial integrity and independence of Nepal,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to promote the national unity while developing mutual cooperative relations between the Federal Units by maintaining mutual cohesion, harmony and solidarity between various castes, tribes, religions, languages, cultures and communities,"
          },
          {
            "subClauseLabel": 3,
            "subClauseDescription": "to maintain law and order by developing a national security system,"
          },
          {
            "subClauseLabel": 4,
            "subClauseDescription": "to guarantee the overall human security system,"
          },
          {
            "subClauseLabel": 5,
            "subClauseDescription": "to make all security organs, including the Nepal Army, Nepal Police and Armed Police Force Nepal, competent, strong, professional, inclusive and accountable to the people, on the basis of national security policies,"
          },
          {
            "subClauseLabel": 6,
            "subClauseDescription": "to make and keep the citizens ready and competent to serve the nation as and when necessary,"
          },
          {
            "subClauseLabel": 7,
            "subClauseDescription": "to make proper use, in nations' interest, of the knowledge, skills and experiences of former public employees including former employees, military and police."
          }
        ]
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "Policies relating to political and governance system of State:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to guarantee the best interests and prosperity of the people through economic, social and cultural transformations, while safeguarding, consolidating and developing political achievements,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to maintain rule of law by protecting and promoting human rights,"
          },
          {
            "subClauseLabel": 3,
            "subClauseDescription": "to implement international treaties, agreements to which Nepal is a party,"
          },
          {
            "subClauseLabel": 4,
            "subClauseDescription": "to guarantee good governance by ensuring the equal and easy access of the people to the services and facilities delivered by the State, while making public administration fair, competent, impartial, transparent, free from corruption, accountable and participatory,"
          },
          {
            "subClauseLabel": 5,
            "subClauseDescription": "to make necessary provisions to make mass media fair, healthy, impartial, decent, responsible and professional,"
          },
          {
            "subClauseLabel": 6,
            "subClauseDescription": "to develop and expand harmonious and cooperative relations between the Federal Units by way of sharing of responsibilities, resources and administration between them."
          }
        ]
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "Relating to social and cultural transformation:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to build the society founded on cordial social relations by developing a healthy and civilized culture,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to carrying out studies, research works, excavation and dissemination for the protection, promotion and development of ancient, archaeological and cultural heritages,"
          },
          {
            "subClauseLabel": 3,
            "subClauseDescription": "to make community development through enhancement of local public participation, by promoting and mobilizing the creativity of local communities in social, cultural and service-oriented works,"
          },
          {
            "subClauseLabel": 4,
            "subClauseDescription": "to focus on the development of arts, literature and music which form cultural heritages,"
          },
          {
            "subClauseLabel": 5,
            "subClauseDescription": "to end all forms of discrimination, inequality, exploitation and injustice in the name of religion, custom, usage, practice and tradition existing in the society,"
          },
          {
            "subClauseLabel": 6,
            "subClauseDescription": "to protect and develop languages, scripts, culture, literature, arts, motion pictures and heritages of various castes, tribes, and communities on the basis of equality and co-existence, while maintaining the cultural diversity of the country,"
          },
          {
            "subClauseLabel": 7,
            "subClauseDescription": "to pursue a multi-lingual policy."
          }
        ]
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "Relating to economy, industry and commerce:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to enhance national economy through partnership and independent development of the public, private and cooperative sectors,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to achieve economic prosperity by way of optimum mobilization of the available means and resources, while focusing on the role of private sector in economy,"
          },
          {
            "subClauseLabel": 3,
            "subClauseDescription": "to promote the cooperative sector and mobilize it in national development to the maximum extent,"
          },
          {
            "subClauseLabel": 4,
            "subClauseDescription": "to encourage and mobilize the economic sector in the overall national development, while providing for regulation to maintain fairness, accountability and competition in all of its activities,"
          },
          {
            "subClauseLabel": 5,
            "subClauseDescription": "to make equitable distribution of the available means and resources and benefits of economic development,"
          },
          {
            "subClauseLabel": 6,
            "subClauseDescription": "to diversify and expand markets for goods and services, while promoting exports through development and expansion of industries upon identifying areas of comparative advantage,"
          },
          {
            "subClauseLabel": 7,
            "subClauseDescription": "to protect the interests of consumers by maintaining trade fairness and discipline by making national economy competitive, while ending activities such as creating black marketing, monopoly, artificial scarcity and restricting competition,"
          },
          {
            "subClauseLabel": 8,
            "subClauseDescription": "to protect and promote domestic industries and resources and accord priority to domestic investment based on Nepalese labour, skills and raw materials for the development of national economy,"
          },
          {
            "subClauseLabel": 9,
            "subClauseDescription": "to give priority to domestic investment for the development of national economy,"
          },
          {
            "subClauseLabel": 10,
            "subClauseDescription": "to encourage foreign capital and technological investment in areas of import substitution and export promotion, in consonance with national interest, and encourage and mobilize such investment in infrastructure building,"
          },
          {
            "subClauseLabel": 11,
            "subClauseDescription": "to make the obtaining of foreign assistance transparent, while making the national needs and priorities as the basis for obtaining foreign assistance, and incorporating amounts received in form of foreign assistance in the national budget,"
          },
          {
            "subClauseLabel": 12,
            "subClauseDescription": "to utilize knowledge, skill, technology and capital of the non-resident Nepalese in the national development,"
          },
          {
            "subClauseLabel": 13,
            "subClauseDescription": "to give dynamism to the economic development by establishing coordination between the States and the States and the Federation in relation to industrial corridors, special economic zones, national projects and projects involving foreign investment."
          }
        ]
      },
      {
        "clauseNumber": "E",
        "clauseDescription": "Policies relating to agriculture and land reforms:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to make scientific land reforms having regard to the interests of the farmers, while ending the dual ownership existing in the lands,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to enhance product and productivity by carrying out land pooling, while discouraging inactive land ownership,"
          },
          {
            "subClauseLabel": 3,
            "subClauseDescription": "to make land management and commercialization, industrialization, diversification and modernization of agriculture, by pursuing land-use policies to enhance agriculture product and productivity, while protecting and promoting the rights and interests of the farmers,"
          },
          {
            "subClauseLabel": 4,
            "subClauseDescription": "to make proper use of lands, while regulating and managing lands on the basis of, inter alia, productivity, nature of lands and ecological balance,"
          },
          {
            "subClauseLabel": 5,
            "subClauseDescription": "to provide for the farmers' access to agricultural inputs, agro- products at fair price and market."
          }
        ]
      },
      {
        "clauseNumber": "F",
        "clauseDescription": "Policies relating to development:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to formulate sustainable socio-economic development strategies and programs under the regional development plan for inclusive economic development with regional balance, and implement them in a coordinative manner,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to develop balanced, environment friendly, quality and sustainable physical infrastructures, while according priority to the regions lagging behind from development perspective,"
          },
          {
            "subClauseLabel": 3,
            "subClauseDescription": "to enhance local public participation in the process of development works,"
          },
          {
            "subClauseLabel": 4,
            "subClauseDescription": "to enhance investment in scientific study, research works and in invention, progress and development of science and technology, and protect scientists, technologists, intellectual and eminent talents,"
          },
          {
            "subClauseLabel": 5,
            "subClauseDescription": "to ensure easy and simple access of the general public to information technology by developing and expanding information technology to the tune of national needs, and make optimum utilization of information technology in the national development,"
          },
          {
            "subClauseLabel": 6,
            "subClauseDescription": "to make provisions enabling the general public to enjoy fruits of development in a just manner, while according priority to the indigent citizens in the distribution of such fruits,"
          },
          {
            "subClauseLabel": 7,
            "subClauseDescription": "to develop an integrated national identity management information system and manage all kinds of information and data of the citizens in an integrated manner, and linking such system with the services and facilities provided by the State and with national development plans,"
          },
          {
            "subClauseLabel": 8,
            "subClauseDescription": "to update demographic statistics and linking it with national development plans."
          }
        ]
      },
      {
        "clauseNumber": "G",
        "clauseDescription": "Policies relating to protection, promotion and use of natural resources:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to protect, promote, and make environmental friendly and sustainable use of, natural resources available in the country, in consonance with national interest and adopting the concept of inter-generational equity, and make equitable distribution of fruits, according priority and preferential right to the local communities,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to make multi-purpose development of water resources, while according priority to domestic investment based on public participation,"
          },
          {
            "subClauseLabel": 3,
            "subClauseDescription": "to ensure reliable supply of energy in an affordable and easy manner, and make proper use of energy, for the fulfilment of the basic needs of citizens, by generating and developing renewable energy,"
          },
          {
            "subClauseLabel": 4,
            "subClauseDescription": "to develop sustainable and reliable irrigation by making control of water-induced disasters, and river management,"
          },
          {
            "subClauseLabel": 5,
            "subClauseDescription": "to conserve, promote, and make sustainable use of, forests, wildlife, birds, vegetation and bio-diversity, by mitigating possible risks to environment from industrial and physical development, while raising awareness of general public about environment cleanliness,"
          },
          {
            "subClauseLabel": 6,
            "subClauseDescription": "to maintain the forest area in necessary lands for ecological balance,"
          },
          {
            "subClauseLabel": 7,
            "subClauseDescription": "to adopt appropriate measures to abolish or mitigate existing or possible adverse environmental impacts on the nature, environment or biological diversity,"
          },
          {
            "subClauseLabel": 8,
            "subClauseDescription": "to pursue the principles of environmentally sustainable development such as the principles of polluter pays, of precaution in environmental protection and of prior informed consent."
          },
          {
            "subClauseLabel": 9,
            "subClauseDescription": "to make advance warning, preparedness, rescue, relief and rehabilitation in order to mitigate risks from natural disasters."
          }
        ]
      },
      {
        "clauseNumber": "H",
        "clauseDescription": "Policies relating to basic needs of the citizens:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to prepare human resources that are competent, competitive, ethical, and devoted to national interests, while making education scientific, technical, vocational, empirical, employment and people-oriented,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to make private sector investment made in education service-oriented by regulating and managing such investment, while enhancing the State's investment in the education sector,"
          },
          {
            "subClauseLabel": 3,
            "subClauseDescription": "to make higher education easy, qualitative and accessible, and free gradually,"
          },
          {
            "subClauseLabel": 4,
            "subClauseDescription": "to establish and promote community information centres and libraries for the personality development of citizens,"
          },
          {
            "subClauseLabel": 5,
            "subClauseDescription": "to keep on enhancing investment necessary in the public health sector by the State in order to make the citizens healthy,"
          },
          {
            "subClauseLabel": 6,
            "subClauseDescription": "to ensure easy, convenient and equal access of all to quality health services,"
          },
          {
            "subClauseLabel": 7,
            "subClauseDescription": "to protect and promote health systems including Ayurveda, as a traditional medical system of Nepal, natural therapy and homeopathy system,"
          },
          {
            "subClauseLabel": 8,
            "subClauseDescription": "to make private sector investment in the health sector service-oriented by regulating and managing such investment, while enhancing the State's investment in this sector,"
          },
          {
            "subClauseLabel": 9,
            "subClauseDescription": "to focus on health research and keep on increasing the number of health institutions and health workers in order to make health services widely available and qualitative,"
          },
          {
            "subClauseLabel": 10,
            "subClauseDescription": "to increase average life expectancy by reducing maternal and infant mortality rate, while encouraging family planning for population management on the basis of Nepal's capacity and need,"
          },
          {
            "subClauseLabel": 11,
            "subClauseDescription": "to manage unplanned settlement and develop planned and systematic settlement,"
          },
          {
            "subClauseLabel": 12,
            "subClauseDescription": "to provide for sustainable production, supplies, storage, security, and easy and effective distribution of foods by encouraging food production in tune with climate and soil, in consonance with the concept of food sovereignty, while enhancing investment in the agriculture sector,"
          },
          {
            "subClauseLabel": 13,
            "subClauseDescription": "to ensure planned supply system by according special priority to the remote and backward regions, while ensuring equal access of all citizens to basic goods and services,"
          },
          {
            "subClauseLabel": 14,
            "subClauseDescription": "to enhance investment in the transportation sector, while ensuring simple, easy and equal access of the citizens to transportation facilities, and to make the transportation sector safe, systematic and persons with disabilities friendly by encouraging public transportation and regulating private transportation, while according priority to the environment friendly technologies,"
          },
          {
            "subClauseLabel": 15,
            "subClauseDescription": "to arrange for access to medical treatment while ensuring citizen's health insurance."
          }
        ]
      },
      {
        "clauseNumber": "I",
        "clauseDescription": "Policies relating to labour and employment:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to make competent and professional the labour force that has remained as the main socio-economic strength of the country and enhance employment within the country, while ensuring a situation enabling all to work,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to guarantee social security, while ensuring the basic rights of all labours, in consonance with the concept of decent labour,"
          },
          {
            "subClauseLabel": 3,
            "subClauseDescription": "to abolish all forms of labour exploitation including child labour,"
          },
          {
            "subClauseLabel": 4,
            "subClauseDescription": "to encourage participation of labours in management, while maintain cordial relations between the labours and entrepreneurs,"
          },
          {
            "subClauseLabel": 5,
            "subClauseDescription": "to regulate and manage the sector in order to make foreign employment free from exploitation, safe and systematic and to guarantee employment and rights of the labours,"
          },
          {
            "subClauseLabel": 6,
            "subClauseDescription": "to encourage to mobilize the capital, skills, technology and experience gained from foreign employment in productive sectors in the country."
          }
        ]
      },
      {
        "clauseNumber": "J",
        "clauseDescription": "Policies relating to social justice and inclusion:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to keep on making appropriate arrangements for the livelihoods of the helpless single women, while according priority to them in employment on the basis of skills, competency and qualification,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to make self-dependent the women who are vulnerable, subjected to social and family exclusion and victims of violence self-reliant by making their rehabilitation, protection and empowerment,"
          },
          {
            "subClauseLabel": 3,
            "subClauseDescription": "to ensure enjoyment of requisite services and facilities at the reproductive stage,"
          },
          {
            "subClauseLabel": 4,
            "subClauseDescription": "to evaluate economically the work and contribution such as maintenance of children and care of families,"
          },
          {
            "subClauseLabel": 5,
            "subClauseDescription": "to take into consideration primarily of the best interests of the child,"
          },
          {
            "subClauseLabel": 6,
            "subClauseDescription": "to identify the freed bonded labours, Kamlari, Harawa, Charawa, tillers, landless, squatters and rehabilitate them by providing housing, housing plot for residence and cultivable land or employment for their livelihoods,"
          },
          {
            "subClauseLabel": 7,
            "subClauseDescription": "to create an atmosphere conducive to the full enjoyment of the political, economic, social and cultural rights, while enhancing the participation of youths in national development, to make their personality development, while providing special opportunity in areas including education, health and employment for the empowerment and development of the youths and provide them with appropriate opportunities for the overall development of the State,"
          },
          {
            "subClauseLabel": 8,
            "subClauseDescription": "to make the indigenous nationalities participate in decisions concerning that community by making special provisions for opportunities and benefits in order to ensure the right of these nationalities to live with dignity, along with their identity, and protect and promote traditional knowledge, skill, culture, social tradition and experience of the indigenous nationalities and local communities,"
          },
          {
            "subClauseLabel": 9,
            "subClauseDescription": "to make special provisions for opportunities and benefits to minority communities to enjoy social and cultural rights, with maintaining their identity,"
          },
          {
            "subClauseLabel": 10,
            "subClauseDescription": "to make special provisions for equal distribution of economic, social and cultural opportunities and benefits to the Madhesi community, Muslims and backward class, and for opportunities and benefits to the indigent citizens within such communities for their protection, upliftment, empowerment and development,"
          },
          {
            "subClauseLabel": 11,
            "subClauseDescription": "to make special provisions for opportunities and benefits for the protection, upliftment, empowerment and development of the citizens of the oppressed and backward regions and for the fulfilment of their basic needs,"
          },
          {
            "subClauseLabel": 12,
            "subClauseDescription": "to accord priority to the indigent within all sexes, regions and communities in the provision of social security and social justice,"
          },
          {
            "subClauseLabel": 13,
            "subClauseDescription": "to make planned investment in sports and sport-persons in order to prepare healthy, competent and disciplined citizens, and to develop sports as a means of consolidating national unity and enhancing national prestige at the international level,"
          },
          {
            "subClauseLabel": 14,
            "subClauseDescription": "to adopt a single door system for the establishment, approval, operation, regulation and management of community-based and national or international non-governmental organizations and to involve such organizations only in the sectors of national need and priority, while making investment and role of such organizations transparent and accountable."
          }
        ]
      },
      {
        "clauseNumber": "K",
        "clauseDescription": "Policies relating to justice and penal system:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to make the administration of justice speedy, efficient, widely available, economical, impartial, effective, and accountable to people,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to pursue alternative means such as mediation and arbitration for the settlement of disputes of general nature,"
          },
          {
            "subClauseLabel": 3,
            "subClauseDescription": "to adopt effective measures for the control of corruption and irregularities in all sectors including political, administrative, judicial and social sectors."
          }
        ]
      },
      {
        "clauseNumber": "L",
        "clauseDescription": "Policies relating to tourism: To develop eco-friendly tourism industries as an important base of national economy by way of identification, protection, promotion and publicity of the ancient, cultural, religious, archaeological and natural heritages of Nepal, to make environment and policy required for the development of tourism culture, and to accord priority to local people in the distribution of benefits of tourism industries."
      },
      {
        "clauseNumber": "M",
        "clauseDescription": "Policies relating to international relations:",
        "subClauses": [
          {
            "subClauseLabel": 1,
            "subClauseDescription": "to conduct an independent foreign policy based on the Charter of the United Nations, non-alignment, principles of Panchsheel, international law and the norms of world peace, taking into consideration of the overall interest of the nation, while remaining active in safeguarding the sovereignty, territorial integrity, independence and national interest of Nepal,"
          },
          {
            "subClauseLabel": 2,
            "subClauseDescription": "to review treaties concluded in the past, and make treaties, agreements based on equality and mutual interest."
          }
        ]
      }
    ]
  },
  {
    "part": "PartFour",
    "articleNumber": 52,
    "articleTitle": "Obligations of the State",
    "articleDescription": "It shall be the obligation of the State to make Nepal a prosperous and affluent country by protecting and promoting fundamental rights and human rights, pursuing directive principles of the State and gradually implementing policies of the State, while keeping intact the freedom, sovereignty, territorial integrity and independence of Nepal."
  },
  {
    "part": "PartFour",
    "articleNumber": 53,
    "articleTitle": "To submit report",
    "articleDescription": "The Government of Nepal shall submit an annual report containing the steps taken and achievements made in the implementation of the directive principles, policies and obligations of the State set forth in this Part to the President, and the President shall cause such report to be laid through the Prime Minister before the Federal Parliament."
  },
  {
    "part": "PartFour",
    "articleNumber": 54,
    "articleTitle": "Provisions relating to monitoring",
    "articleDescription": "There shall be a committee, in accordance with law, in the Federal Parliament in order to monitor and evaluate whether the directive principles, policies and obligations of the State set forth in this Part have been implemented progressively or not."
  },
  {
    "part": "PartFour",
    "articleNumber": 55,
    "articleTitle": "Questions not to be raised in court",
    "articleDescription": "No question shall be raised in any court as to whether any matter contained in this Part has been implemented or not."
  },
  {
    "part": "PartFive",
    "articleNumber": 56,
    "articleTitle": "Structure of State",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The main structure of the Federal Democratic Republic of Nepal shall be of three levels, namely the Federation, the State and the Local level."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Federation, State and Local levels shall exercise the power of State of Nepal pursuant to this Constitution and law."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "There shall be States consisting of the Districts as mentioned in Schedule-4 existing in Nepal at the time of commencement of this Constitution."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "There shall be Village Institutions, Municipalities and District Assemblies under the Local level. The number of Wards in a Village Institution and Municipality shall be as provided for in the Federal law."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Any Special, Protected or Autonomous Region can be set by the Federal law for social, cultural protection or economic development."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The Federation, State and Local levels shall protect Nepal's freedom, sovereignty, territorial integrity, independence, national interest, overall development, multi-party, competitive, democratic, republican, federal system of governance, human rights and fundamental rights, rule of law, separation of powers and check and balance, egalitarian society based on pluralism and equality, inclusive representation and identity."
      }
    ]
  },
  {
    "part": "PartFive",
    "articleNumber": 57,
    "articleTitle": "Distribution of State power",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The powers of the Federation shall be vested in the matters enumerated in Schedule-5, and such powers shall be exercised pursuant to this Constitution and the Federal law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The powers of a State shall be vested in the matters enumerated in Schedule-6, and such powers shall be exercised pursuant to this Constitution and the State law."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The concurrent powers of the Federation and the State shall be vested in the matters enumerated in Schedule-7, and such powers shall be exercised pursuant to this Constitution, the Federal law and the State law."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The powers of the Local level shall be vested in the matters enumerated in Schedule-8, and such powers shall be exercised pursuant to this Constitution and the law made by the Village Assembly or Municipal Assembly."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "The concurrent powers of the Federation, State and Local levels shall be vested in the matters enumerated in Schedule-9, and such powers shall be exercised pursuant to this Constitution, the Federal law, the State law and the law made by the Village Assembly or Municipal Assembly."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "Any law to be made by the State Assembly, Village Assembly or Municipal Assembly pursuant to clause (3) or (5) shall be so made as not to be inconsistent with the Federal law, and any law made by the State Assembly, Village Assembly or Municipal Assembly which is inconsistent with the Federal law shall be invalid to the extent of such inconsistency."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "Any law to be made by the Village Assembly or Municipal Assembly pursuant to clause (5) shall be so made as not to be inconsistent with the State law, and any law made by the Village Assembly or Municipal Assembly which is inconsistent with the State law shall be invalid to the extent of such inconsistency."
      }
    ]
  },
  {
    "part": "PartFive",
    "articleNumber": 58,
    "articleTitle": "Residual powers",
    "articleDescription": "The Federation shall have power on any matter not enumerated in the Federal List, State List, List of Local level or Concurrent List or on any matter which is not so specified in this Constitution as to be exercised by any level."
  },
  {
    "part": "PartFive",
    "articleNumber": 59,
    "articleTitle": "Exercise of financial powers",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Federation, State and Local level shall make laws, make annual budget, decisions, formulate and implement policies and plans on any matters related to financial powers within their respective jurisdictions."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Federation may so make necessary policies, standards and laws on any of the matters enumerated in the Concurrent List and other areas of financial powers as to be applicable also to the States."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The Federation, State and Local level shall make budget of their respective levels, and the time for submission of budget by the State and Local level shall be as provided for in the Federal law."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The Federation, State and Local level shall provide for the equitable distribution of benefits derived from the use of natural resources or development. Certain portions of such benefits shall be distributed, pursuant to law, in forms of royalty, services or goods to the project affected regions and local communities."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "If, in utilising natural resources, the local community desires to make investment therein, the Federation, State and Local level shall accord priority to such investment in such portion as provided by law on the basis of the nature and size of such investment."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The Government of Nepal shall have power to obtain foreign assistance and borrow loans. Such assistance or loans shall be so obtained or borrowed as to have macro-economic stability of the country."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "Provisions relating to the management of budget deficits and other fiscal discipline of the Federation, State and Local level shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartFive",
    "articleNumber": 60,
    "articleTitle": "Distribution of sources of revenue",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Federation, State and Local level may impose taxes on matters falling within their respective jurisdiction and collect revenue from these sources.",
        "clauseExtraInfo": "Provided that provisions relating to the imposition of taxes and collection of revenue on matters that fall within the Concurrent List and on matters that are not included in the List of any level shall be as determined by the Government of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Government of Nepal shall make provisions for the equitable distribution of the collected revenue to the Federation, State and Local level."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The amount of fiscal transfer receivable by the State and Local level shall be as recommended by the National Natural Resources and Fiscal Commission."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The Government of Nepal shall, on the basis of the need of expenditure and revenue capacity, distribute fiscal equalization grants to the State and Local level."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Each State shall, in accordance with the State law, distribute fiscal equalization grants out of the grants received from the Government of Nepal and revenues collected from its sources, on the basis of the need of expenditure and revenue capacity of its subordinate Local level."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "Provisions relating to distribution of conditional grants, complementary grants or special grants for other purposes to be provided by the Government of Nepal from the Federal Consolidated Fund shall be as provided for in the Federal law."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "Distribution of revenues between the Federal, State and Local level shall be made in a balanced and transparent manner."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "A Federal Act on the distribution of revenues shall be made having regard to the national policies, national requirements, autonomy of the State and Local levels, services to be rendered by the State and the Local level to the people and financial powers granted to them, capacity to collect revenues, potentiality and use of revenues, assistance to be made in development works, reduction of regional imbalances, poverty and inequality, end of deprivation, and assistance to be made in the performance of contingent works and fulfilment of temporary needs."
      }
    ]
  },
  {
    "part": "PartSix",
    "articleNumber": 61,
    "articleTitle": "President",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a President of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The President shall be the head of state of Nepal. He or she shall perform his or her functions in accordance with this Constitution and the Federal law."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The President shall promote the national unity of Nepal."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The main duty of the President shall be to abide by and protect this Constitution."
      }
    ]
  },
  {
    "part": "PartSix",
    "articleNumber": 62,
    "articleTitle": "Election of President",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The President shall be elected by an electoral college composed of the members of the Federal Parliament and of the State Assemblies. The voting weightage of the members of the Federal Parliament and of the State Assemblies shall vary as provided for in the Federal law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Notwithstanding anything contained in clause (1), nothing shall be deemed to bar the formation of an electoral college for the purpose of election to the President by the sole reason that election to the State Assembly has not been held in any State."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "A person who secures a majority of the then existing total votes of the electoral college under clause (1) shall be elected as the President."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "If none of the candidates secures a majority under clause (3), there shall be voting between the two candidates who have secured the highest number of votes, and a candidate who secures more than fifty percent of the total votes in such a voting shall be elected as the President."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "If none of the candidates secures more than fifty percent of the total votes even in the voting under clause (4), re-voting shall be held. A candidate who secures a majority of the total valid votes cast in such voting shall be elected as the President."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "If a person who holds a political office to be filled by way of election, nomination or appointment is appointed as the President under this Article, his or her such office shall ipso facto be vacant."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "Election to the President and other matters related thereto shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartSix",
    "articleNumber": 63,
    "articleTitle": "Term of office of President",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The term of office of the President shall be five years from the date on which he or she is so elected."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The President whose term of office under clause (1) has expired shall continue to discharge the functions under this Constitution until another elected President assumes his or her office."
      }
    ]
  },
  {
    "part": "PartSix",
    "articleNumber": 64,
    "articleTitle": "Qualification for President",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A person who has the following qualification shall be qualified to become the President:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "being qualified to become a member of the Federal Parliament,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "having completed the age of at least forty five years, and"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "not being disqualified by any law."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Notwithstanding anything contained in clause (1), a person who has already been elected twice as the President shall not become a candidate in the election to the President."
      }
    ]
  },
  {
    "part": "PartSix",
    "articleNumber": 65,
    "articleTitle": "Vacation of office of President",
    "articleDescription": "The office of the President shall become vacant in any of the following circumstances:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "if he or she tenders resignation in writing to the Vice-President,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "if a motion of impeachment against him or her is passed under Article 101,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "if his or her term of office expires,"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "If he or she dies."
      }
    ]
  },
  {
    "part": "PartSix",
    "articleNumber": 66,
    "articleTitle": "Functions, duties and powers of President",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The President shall exercise such powers and perform such duties as conferred to him or her pursuant to this Constitution or a Federal law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "In exercising the powers or duties under clause (1), the President shall perform all other functions to be performed by him or her on recommendation and with the consent of the Council of Ministers than those functions specifically provided to be performed on recommendation of any body or official under this Constitution or Federal Law. Such recommendation and consent shall be submitted through the Prime Minister."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Any decision or order to be issued in the name of the President under clause (2) and other instrument of authorization pertaining thereto shall be authenticated as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartSix",
    "articleNumber": 67,
    "articleTitle": "Vice-President",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a Vice-president of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The functions to be performed by the President shall be performed by the Vice-president during the absence of the President."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If a person who holds a political office to be filled by way of election, nomination or appointment is appointed as the Vice-president, his or her such office shall ipso facto be vacant."
      }
    ]
  },
  {
    "part": "PartSix",
    "articleNumber": 68,
    "articleTitle": "Vacation of office of Vice-president",
    "articleDescription": "The office of the Vice-president shall become vacant in any of the following circumstances:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "if he or she tenders resignation in writing to the President,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "if a motion of impeachment against him or her is passed under Article 101,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "if his or her term of office expires,"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "if he or she dies."
      }
    ]
  },
  {
    "part": "PartSix",
    "articleNumber": 69,
    "articleTitle": "Other provisions relating to Vice-President",
    "articleDescription": "Provisions relating to the qualification, procedures of election and term of office of the Vice-President shall be the same as that of the President."
  },
  {
    "part": "PartSix",
    "articleNumber": 70,
    "articleTitle": "President and Vice-President to be from different sex or community",
    "articleDescription": "Election to the President and the Vice-president under this Constitution shall be so made as to have representation of different sex or community."
  },
  {
    "part": "PartSix",
    "articleNumber": 71,
    "articleTitle": "Oath by President and Vice-President",
    "articleDescription": "Prior to assuming their respective offices, the President shall take an oath of office and secrecy before the Chief Justice, and the Vice-President, before the President, as provided for in the Federal law."
  },
  {
    "part": "PartSix",
    "articleNumber": 72,
    "articleTitle": "Remuneration and facilities of President and Vice-President",
    "articleDescription": "The remuneration and other facilities of the President and the Vice-president shall be as provided for in the Federal Act, and as specified by the Government of Nepal until such Act is made."
  },
  {
    "part": "PartSix",
    "articleNumber": 73,
    "articleTitle": "Office of President and Vice-President",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be separate offices for the performance of the functions of the President and the Vice-President."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Government of Nepal shall make arrangements for employees and other provisions as required to perform the functions of the offices under clause (1)."
      }
    ]
  },
  {
    "part": "PartSeven",
    "articleNumber": 74,
    "articleTitle": "Form of government",
    "articleDescription": "The form of government of Nepal shall be multi-party, competitive, federal, democratic, republican, parliamentary form of government based on pluralism."
  },
  {
    "part": "PartSeven",
    "articleNumber": 75,
    "articleTitle": "Executive power",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The executive power of Nepal shall, pursuant to this Constitution and law, be vested in the Council of Ministers."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The responsibility for issuing general directives, controlling and regulating the governance of Nepal shall, subject to this Constitution and law, lie in the Council of Ministers."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "All Federal executive functions of Nepal shall be performed in the name of the Government of Nepal."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Any decision or order to be issued in the name of the Government of Nepal pursuant to clause (3) and other instruments of authorization pertaining thereto shall be authenticated as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartSeven",
    "articleNumber": 76,
    "articleTitle": "Constitution of Council of Ministers",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The President shall appoint the leader of a parliamentary party that commands majority in the House of Representatives as the Prime Minister, and the Council of Ministers shall be constituted under his or her chairpersonship."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "In cases where no party has a clear majority in the House of Representatives under clause (1), the President shall appoint as the Prime Minister a member of the House of Representatives who can command majority with the support of two or more parties representing to the House of Representatives."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "In cases where Prime Minister cannot be appointed under clause (2) no later than thirty days after the date of declaration of the final results of election to the House of Representatives or the Prime Minister so appointed fails to secure a vote of confidence under clause (4), the President shall appoint as the Prime Minister the parliamentary party leader of the party which has the highest number of members in the House of Representatives."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The Prime Minister appointed under clause (2) or (3) shall obtain a vote of confidence from the House of Representatives no later than thirty days after the date of such appointment."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "In cases where the Prime Minister appointed under clause (3) fails to obtain a vote of confidence under clause (4) and any member under clause (2) presents a ground on which he or she can obtain a vote of confidence in the House of Representatives, the President shall appoint such member as the Prime Minister."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The Prime Minister appointed under clause (5) must obtain a vote of confidence under clause (4)."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "In cases where the Prime Minister appointed under clause (5) fails to obtain a vote of confidence or the Prime Minister cannot be appointed, the President shall, on recommendation of the Prime Minister, dissolve the House of Representatives and appoint a date of election so that the election to another House of Representatives is completed within six months."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "Procedures on the appointment of the Prime Minister under this Article must be completed no later than thirty five days after the date of declaration of the final results of election to the House of Representatives held under this Constitution or the date on which the office of the Prime Minister has fallen vacant."
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "The President shall, on recommendation of the Prime Minister, constitute the Council of Ministers comprising a maximum of twenty five Ministers including the Prime Minister, in accordance with the inclusive principle, from amongst the members of the Federal Parliament.",
        "clauseExplanation": "For the purposes of this Article, 'Minister' means a Deputy Prime Minister, Minister, Minister of State and Assistant Minister."
      },
      {
        "clauseNumber": 10,
        "clauseDescription": "The Prime Minister and Ministers shall be collectively responsible to the Federal Parliament, and the Ministers shall be individually responsible for the work of their respective Ministries to the Prime Minister and the Federal Parliament."
      }
    ]
  },
  {
    "part": "PartSeven",
    "articleNumber": 77,
    "articleTitle": "Vacation of office of Prime Minister and Minister",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The office of the Prime Minister shall be vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she tenders resignation in writing to the President,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if a vote of confidence is not passed or a vote of no-confidence is passed against him or her under Article 100,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if he or she ceases to be a member of the House of Representatives,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The office of a Minister shall be vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she tenders resignation in writing to the Prime Minister,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if the Prime Minister removes him or her from office,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if the office of Prime Minister falls vacant under sub-clause (A), (B) or (C) of clause (1),"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If the office of Prime Minister falls vacant under clause (1), the same Council of Ministers shall continue to act until another Council of Ministers is constituted.",
        "clauseExtraInfo": "Provided that if the Prime Minister dies, the senior-most Minister shall act as the Prime Minister until a new Prime Minister is appointed."
      }
    ]
  },
  {
    "part": "PartSeven",
    "articleNumber": 78,
    "articleTitle": "Non-member of Federal Parliament to be Minister",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Notwithstanding anything contained in clause (9) of Article 76, the President may, on recommendation of the Prime Minister, appoint a person who is not a member of the Federal Parliament as a Minister"
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Minister appointed under clause (1) must obtain membership of the Federal Parliament within six months from the date of taking oath by him or her."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "In the event of failure to obtain membership of the Federal Parliament within the period mentioned in clause (2), he or she shall not be qualified to be reappointed to the office of Minister during the term of the then House of Representatives."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Notwithstanding anything contained in clause (1), a person who has been defeated in the election to the then House of Representatives shall not be qualified to be appointed to the office of Minister during the term of such House of Representatives."
      }
    ]
  },
  {
    "part": "PartSeven",
    "articleNumber": 79,
    "articleTitle": "Remuneration and other facilities of Prime Minister and Ministers",
    "articleDescription": "The remuneration and other facilities of the Prime Minister and Ministers shall be as provided for in the Federal Act, and shall be as specified by the Government of Nepal until such Act is made."
  },
  {
    "part": "PartSeven",
    "articleNumber": 80,
    "articleTitle": "Oath",
    "articleDescription": "The Prime Minister, Deputy Prime Minister and Ministers shall take an oath of office and secrecy before the President, and Ministers of State and Assistant Ministers, before the Prime Minister, as provided for in the Federal law, prior to assuming their respective offices."
  },
  {
    "part": "PartSeven",
    "articleNumber": 81,
    "articleTitle": "To inform President",
    "articleDescription": "The Prime Minister shall inform the President about the following matters:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "resolutions of the Council of Ministers,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "Bills to be introduced in the Federal Parliament,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "such other necessary information as commanded by the President on matters set forth in clauses (A) and (B), and"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "current general state of affairs of the country and matters concerning foreign relations."
      }
    ]
  },
  {
    "part": "PartSeven",
    "articleNumber": 82,
    "articleTitle": "Transaction of business of Government of Nepal",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The business of the Government of Nepal shall be allocated and transacted in accordance with the rules approved by the Government of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No question may be raised in any court as to whether or not the rules under clause (1) have been observed."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 83,
    "articleTitle": "Federal Legislature",
    "articleDescription": "There shall be a Federal Legislature consisting of two Houses to be known as the House of Representatives and the National Assembly, which shall be called as the Federal Parliament."
  },
  {
    "part": "PartEight",
    "articleNumber": 84,
    "articleTitle": "Composition of House of Representatives",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The House of Representatives shall consist of a total of two hundred and seventy five members, as follows:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "One hundred and sixty five members to be elected through the first past the post electoral system, with one being elected from each election constituency of one hundred and sixty five election constituencies delimited in the country on the basis of geography and population,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "One hundred and ten members to be elected through the proportional electoral system where voters vote for political parties, with the whole country being considered as a single election constituency."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Federal law shall provide that, in fielding candidacy by political parties for the election to the House of Representatives under the proportional electoral system, representation shall be ensured on the basis of a closed list also from women, Dalit, indigenous peoples, Khas Arya, Madhesi, Tharu, Muslims and backward regions, on the basis of population. In so fielding candidacy, regard shall also be had to geography and territorial balance.",
        "clauseExplanation": "For the purposes of this clause, 'Khas Arya' means Kshetri, Brahmin, Thakuri, Sanyasi (Dashnami) community."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "In fielding candidacy under clause (2), political parties shall provide for representation of the persons with disabilities as well."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Election to the House of Representatives under clause (1) shall be held through secret ballots in accordance with law."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Each citizen of Nepal who has completed the age of eighteen years shall have the right to vote in any one election constituency as provided for in the Federal law."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "A person who is qualified under Article 87 and entitled to vote in an election to the members of the House of Representatives may, subject to the Federal law, be a candidate in any election constituency.",
        "clauseExtraInfo": "Provided that a person shall not be a candidate in more than one election constituencies at the same time."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "If the seat of any member of the House of Representatives falls vacant while its term still remains for more than six months, the vacancy shall be filled in the same manner of electoral system as in which such seat was filled in."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "Notwithstanding anything contained elsewhere in this Part, at least one third of the total number of members elected from each political party representing in the Federal Parliament must be women. If women are not so elected as to constitute one third of the elected members of any political party under sub-clause (A) of clause (1) and sub-clause (A) of clause (2) of Article 86, such political party must, in electing members under sub-clause (b) of clause (1), so elect that women members constitute at least one third of the total number of members elected to the Federal Parliament from that party."
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "Election to the House of Representatives and other matters pertaining thereto shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 85,
    "articleTitle": "Term of House of Representatives",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Unless dissolved earlier pursuant to this Constitution, the term of the House of Representatives shall be five years."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Notwithstanding anything contained in clause (1), the term of the House of Representatives may be extended by a Federal Act for a period not exceeding one year in cases where a proclamation or order of a state of emergency is in effect."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The term of the House of Representatives extended under clause (2) shall ipso facto expire upon the expiry of six months from the date of voidance of the proclamation or order of the state of emergency."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 86,
    "articleTitle": "Composition of National Assembly and term of office of its members",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The National Assembly shall be a permanent House."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The National Assembly shall consist of fifty nine members as follows:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "fifty six elected members consisting of at least three women, one Dalit and one from persons with disabilities or minorities, from each State by an electoral college composed of members of the State Assembly, chairpersons and vice-chairpersons of the Village Bodies, and Mayors and Deputy-Mayors of the Municipalities, with different weightage of vote by members of the State Assembly, chairpersons and vice-chairpersons of the Village Bodies, and Mayors and Deputy-Mayors of the Municipalities, as provided for in the Federal law,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "Three members consisting of at least one woman nominated by the President on recommendation of the Government of Nepal."
          }
        ]
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The term of office of the members of the National Assembly shall be six years. The term of office of one third of the members of the National Assembly shall expire in every two years.",
        "clauseExtraInfo": "Provided that, for the first time, after the commencement of this Constitution, arrangements shall be made by drawing lots to retire one-third of the members on the expiry of two years, another one-third on the expiry of four years, and the final one-third on the expiry of six years."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "In computing the term of office of the members of the National Assembly for the first time after the commencement of this Constitution, the term of office of all members shall be deemed to have commenced on the day on which the first session of the National Assembly is held."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Any vacancy of seat in the National Assembly shall be filled for the remainder of the term of office in the same manner of election or nomination as in which the seat of the vacating member was filled."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "Other matters relating to election to the members of the National Assembly shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 87,
    "articleTitle": "Qualification for member",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A person who has the following qualification shall be qualified to become a member of the Federal Parliament:",
        "clauseExplanation": "For the purposes of this clause, 'office of profit' means any position, other than a political position which is to be filled by election or nomination, for which a remuneration or economic benefit is paid out of a government fund.",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "being a citizen of Nepal,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "having completed the age of twenty five years, for the House of Representatives, and the age of thirty five years, for the National Assembly,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "not having been convicted of a criminal offense involving moral turpitude,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "not being disqualified by any Federal law, and"
          },
          {
            "subClauseLabel": "E",
            "subClauseDescription": "not holding any office of profit."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No person may be a member of both Houses at the same time."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If a person who holds a political office to be filled by way of election, nomination or appointment is elected or nominated as a member of the Federal Parliament under this Part, his or her such office shall ipso facto be vacant from the day on which he or she takes an oath of office of member of the Federal Parliament."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 88,
    "articleTitle": "Oath",
    "articleDescription": "Every member of each House of the Federal Parliament must, before taking part for the first time in the session of the House or any of its committees, take an oath as provided for in the Federal law."
  },
  {
    "part": "PartEight",
    "articleNumber": 89,
    "articleTitle": "Vacation of seat",
    "articleDescription": "The seat of a member of the Federal Parliament shall become vacant in any of the following circumstances:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "if he or she tenders resignation in writing before the Speaker or Chairperson,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "if he or she is no longer qualified or ceases to possess the qualification under Article 87,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "if the term of the House of Representatives or the term of office of the member of the National Assembly expires,"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "if he or she absents himself or herself from ten consecutive meetings, without giving notice to the concerned House,"
      },
      {
        "clauseNumber": "E",
        "clauseDescription": "if the political party of which he or she was a member when elected provides a notification in accordance with the Federal law that he or she has defected from the party,"
      },
      {
        "clauseNumber": "F",
        "clauseDescription": "if he or she dies."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 90,
    "articleTitle": "Decision as to disqualification of member",
    "articleDescription": "If a question arises as to whether any member of the Federal Parliament is disqualified or has become disqualified under Article 87, the Constitutional Bench of the Supreme Court shall finally decide that question."
  },
  {
    "part": "PartEight",
    "articleNumber": 91,
    "articleTitle": "Speaker and Deputy Speaker of House of Representatives",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The members of the House of Representatives shall, not later than fifteen days of the date of holding of the first meeting of the House of Representatives, elect a Speaker and a Deputy Speaker from amongst themselves."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Election under clause (1) shall be so held that there is one woman out of the Speaker and the Deputy Speaker, and the Speaker and the Deputy Speaker of the House of Representatives shall be representatives from different parties.",
        "clauseExtraInfo": "Provided that if there is no representation of more than one party in the House of Representatives or no candidacy is filed by more than one party in spite of representation, nothing shall prevent the members of the same party from being the Speaker and the Deputy Speaker of the House of Representatives."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If the office of the Speaker or the Deputy Speaker falls vacant, the members of the House of Representatives shall fill the vacancy by electing the Speaker or Deputy Speaker from amongst themselves."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The Deputy Speaker shall, in the absence of the Speaker, chair the House of Representatives."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "if election to the Speaker and the Deputy Speaker is not held or if both the positions become vacant, the attending member who is by age the senior-most shall chair the meeting of the House of Representatives."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The office of the Speaker or Deputy Speaker of the House of Representatives shall become vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she ceases to be a member of the House of Representatives,",
            "subClauseExtraInfo": "Provided that, in the event of dissolution of the House of Representatives, the Speaker and the Deputy Speaker of the House of Representatives holding their respective offices shall continue in office until the previous day of the filing of nominations for another election to the House of Representatives,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if he or she tenders resignation in writing,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if a resolution is passed by a majority of two-thirds of the totalnumber of the then members of the House of Representatives that his or her conduct is not compatible with his or her office."
          }
        ]
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "The Deputy Speaker shall chair a meeting at which deliberations are to be held on a resolution that the conduct of the Speaker of the House of Representatives is not compatible with his or her office. The Speaker of the House of Representatives may take part and vote in the deliberations on such resolution."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 92,
    "articleTitle": "Chairperson and Vice-Chairperson of National Assembly",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The members of the National Assembly shall, not later than fifteen days of the date of holding of its first meeting, elect the Chairperson and the Vice-Chairperson of the National Assembly from amongst themselves."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Election under clause (1) shall be so held that there is one woman out of the Chairperson and the Vice-Chairperson of the National Assembly."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If the office of the Chairperson or Vice-Chairperson of the National Assembly falls vacant, the members of the National Assembly shall fill the vacancy by electing its Chairperson or Vice-Chairperson from amongst themselves."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The Vice-Chairperson of the National Assembly shall, in the absence of its Chairperson, chair the National Assembly."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "If the election to the Chairperson and the Vice-Chairperson of the National Assembly is not held or if both the positions becomes vacant, the member who is by age the senior-most out of the attending members shall chair the meeting of the National Assembly."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The office of the Chairperson or Vice-Chairperson of the National Assembly shall become vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she ceases to be a member of the National Assembly,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if he or she tenders resignation in writing,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if a resolution is passed by a majority of two-thirds of the total number of the then members of the National Assembly that his or her conduct is not compatible with his or her office."
          }
        ]
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "The Vice-Chairperson of the National Assembly shall chair a meeting at which deliberations are to be held on a resolution that the conduct of the Chairperson of the National Assembly is not compatible with his or her office. The Chairperson of the National Assembly may take part and vote in the deliberations on such resolution."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 93,
    "articleTitle": "Summoning and prorogation of session",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The President shall summon a session of the Federal Parliament within thirty days of the declaration of final results of the election to the House of Representatives. Thereafter, the President shall, from time to time, summon sessions of both or either of the Houses pursuant to this Constitution.",
        "clauseExtraInfo": "Provided that the interval between the two consecutive sessions shall not exceed six months."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The President may prorogue the sessions of both or either of the Houses of the Federal Parliament."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If, during the prorogation or recess of the session of the House of Representatives, one-fourth of the total number of its members write a petition that it is desirable to convene a session or meeting, the President shall specify the date and time for such session or meeting. The House of Representatives shall meet or commence its session at the date and time so specified."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 94,
    "articleTitle": "Quorum",
    "articleDescription": "Except as otherwise provided in this Constitution, no question or resolution shall be presented for decision in a meeting of either House of the Federal Parliament unless one-fourth of the total number of its members are present."
  },
  {
    "part": "PartEight",
    "articleNumber": 95,
    "articleTitle": "Address by President",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The President may address either a meeting of any House or a joint sitting of both Houses of the Federal Parliament, and summon the members for that purpose."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The President shall address the first session after election to the House of Representatives and a joint sitting of both Houses of the Federal Parliament after the commencement of the first session of each year."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 96,
    "articleTitle": "Deputy Prime Minister, Minister, Minister of State and Assistant Minister entitled to take part in both Houses",
    "articleDescription": "The Deputy Prime Minister, Minister, Minister of State and Assistant Minister shall be entitled to attend and take part in the proceedings and deliberations of either House of the Federal Parliament or its committees.",
    "articleExtraInfo": "Provided that he or she shall not be entitled to vote in a House or its committee of which he or she is not a member."
  },
  {
    "part": "PartEight",
    "articleNumber": 97,
    "articleTitle": "Formation of committees",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The House of Representatives and the National Assembly may form committees as provided for in the Federal law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "If a resolution is passed by either House demanding that a joint committee of both the Houses be formed for the purpose of managing the working procedures between the two Houses of the Federal Parliament, resolving disagreement on any Bill or for any other specified function, the joint committee shall be formed. The joint committee shall consist of a maximum of twenty five members in the ratio of five members from the House of Representatives to one member from the National Assembly."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 98,
    "articleTitle": "Transaction of business in case of vacancy in seat of member",
    "articleDescription": "Either House of the Federal Parliament shall have the power to transact its business notwithstanding any vacancy in the seat of its member. No proceedings of either House of the Federal Parliament shall become invalid even if it is subsequently discovered that a person who was not so entitled took part in such proceedings."
  },
  {
    "part": "PartEight",
    "articleNumber": 99,
    "articleTitle": "Voting",
    "articleDescription": "Except as otherwise provided in this Constitution, any motions submitted for decision in either House of the Federal Parliament shall be decided by a majority vote of the members present and voting. The member chairing the meeting shall not have the right to vote."
  },
  {
    "part": "PartEight",
    "articleNumber": 100,
    "articleTitle": "Provisions relating to vote of confidence and motion of no-confidence",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Prime Minister may, whenever he or she considers necessary or appropriate to show that he or she has confidence from the House of Representatives, table a motion to that effect in the House of Representatives for the vote of confidence."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "If the political party which the Prime Minister represents is divided or a political party in coalition government withdraws its support, the Prime Minister shall table a motion in the House of Representatives for a vote of confidence within thirty days."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If a motion tabled under clauses (1) and (2) is not passed by a majority of the total number of the then members of the House of Representatives, the Prime Minister shall relieve of his or her office."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "One-fourth of the total number of the then members of the House of Representatives may table a motion of no-confidence in writing that the House has no confidence in the Prime Minister.",
        "clauseExtraInfo": "Provided that a motion of no confidence shall not be tabled until the first two years after the appointment of the Prime Minister and until another one year after the date of failure of the motion of no confidence once tabled."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "A motion of no confidence to be tabled under clause (4) shall also indicate the name of a member proposed for the Prime Minister."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "If a motion of no confidence tabled under clause (4) is passed by a majority of the total number of the then members of the House of Representatives, the Prime Minister shall relieve of his or her office."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "If the office of Prime Minister falls vacant because of the passage of a motion of no confidence under clause (6), the President shall, in accordance with Article 76, appoint as the Prime Minister the member of the House of Representatives proposed under clause (5)."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 101,
    "articleTitle": "Impeachment",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "One fourth of the total number of the then members of the House of Representatives may move a motion of impeachment against the President or Vice-President on the ground of serious violation of this Constitution and the Federal law. If the motion is passed by at least two thirds majority of the total number of the then members of both Houses of the Federal Parliament, he or she shall relive of his or her office."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "One fourth of the total number of the then members of the House of Representatives may move a motion of impeachment against the Chief Justice of Nepal or a Judge of the Supreme Court, member of the Judicial Council, chief or official of a Constitutional Body on the ground of his or her failure to fulfil his or her duties of office because of serious violation of this Constitution and law, incompetence or misconduct or failure to discharge the duties of office honestly or serious violation of the code of conduct. If the motion is passed by at least two thirds majority of the total number of the then members of the House of Representatives, the concerned person shall relieve of his or her office."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "There shall be an impeachment recommendation committee in the House of Representatives for the purpose of making recommendation after inquiring into whether there exist the ground and reason for moving a motion of impeachment against any person under clause (2)."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The committee under clause (3) shall consist of eleven members of the House of Representatives."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "If at least three members of the House of Representatives certify and submit a petition that the received information, notice or petition is admissible on the ground of serious violation of the Constitution or incompetence or misconduct or failure to discharge the duties of office honestly or serious violation of the code of conduct by the person relieving of office on impeachment under clause (2), and the committee under clause (3), upon inquiring into such petition in accordance with Federal law, makes recommendation to the House of Representatives for impeachment proceedings, a motion of impeachment under clause (2) may be moved."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "After the commencement of impeachment proceedings under clause (2), the Chief Justice of Nepal or Judge of the Supreme Court, member of the Judicial Council, chief or official of the Constitutional Body shall not be allowed to discharge the duties of his or her office pending the settlement of such proceedings."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "A person who is charged with impeachment under clause (1) or (2) shall be provided with a reasonable opportunity to defend himself or herself."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "Nothing shall bar the taking of action under the Federal law in relation to the offence, if any, committed while in office by the President or Vice-President, Chief Justice of Nepal or a Judge of the Supreme Court of Nepal, member of the Judicial Council, chief or official of a Constitutional Body who is relieved of office upon the passage of a motion of impeachment under this Article."
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "A person who is relieved of office on the passage of a motion of impeachment under clause (1) or (2) shall not be entitled to obtain any facility accruing from such office and to be appointed or nominated to any public office in the future."
      },
      {
        "clauseNumber": 10,
        "clauseDescription": "Other matters relating to impeachment shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 102,
    "articleTitle": "Penalty for unauthorized presence or voting",
    "articleDescription": "If a person who has not taken oath under Article 88 or who is not a member of the Federal Parliament is present or votes in the capacity of member in a meeting of either House of the Federal Parliament or of its committee, the person shall, by order of the person chairing the meeting, be fined with a sum of five thousand rupees for each instance of such presence or voting, and such fine shall be recovered as a government due."
  },
  {
    "part": "PartEight",
    "articleNumber": 103,
    "articleTitle": "Privileges",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be full freedom of speech in both Houses of the Federal Parliament; and no member shall be arrested, detained or prosecuted in any court for anything expressed or any vote cast by him or her in the House."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Each House of the Federal Parliament shall, subject to this Constitution, have full power to regulate and decide its internal business, and the concerned House shall have the exclusive right to decide whether or not any of its proceedings is regular or irregular. No question shall be raised in any court in this behalf."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "No comment shall be made about the good faith concerning any proceeding of any House of the Federal Parliament, and no publication and broadcasting of any kind shall be made about anything said by any member, intentionally distorting or misinterpreting the meaning of the speech."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The provisions of clauses (1) and (3) shall also apply to other persons who are entitled to participate in the meetings of the House than the members of the Federal Parliament."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "No proceedings shall be initiated in any court against any person in respect of the publication, under the authority granted by any House of the Federal Parliament, of any document, report, vote or proceeding.",
        "clauseExplanation": "For the purposes of clauses (1), (2), (3) and (4), 'House' means the House of Representatives or the National Assembly, and includes a joint sitting or committee or joint committee of the Federal Parliament."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "No member of the Federal Parliament shall be arrested during the period from the issuance of a notice summoning the session to its prorogation.",
        "clauseExtraInfo": "Provided that nothing in this clause shall be deemed to bar the arresting under the Federal law of any member on a criminal charge. If any member is so arrested, the authority making such arrest shall forthwith give information thereof to the person presiding over the concerned House."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "Any breach of the privileges shall be deemed to constitute contempt of the Federal Parliament, and the concerned House shall have the exclusive right to decide whether any privilege has been breached."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "If any person is in contempt of any House, the person presiding over the concerned House may, after a decision by the House to that effect, admonish, warn or impose a sentence of imprisonment for a term not exceeding three months or of a fine not exceeding ten thousand rupees on such person, and such fine shall be recovered as a government due.",
        "clauseExtraInfo": "Provided that if such person apologies to the satisfaction of the concerned House, it may pardon, remit or commute the sentence imposed on, him or her."
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "Other matters relating to the privileges of the Federal Parliament shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 104,
    "articleTitle": "Procedures relating to conduct of business",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Each House of the Federal Parliament shall frame rules to conduct its business, maintain order during its meetings and regulate the constitution, functions and procedures of the committees and procedures of the House or its committee. Until such rules are framed, the Federal Parliament shall regulate its procedures on its own."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The conduct of business of the joint sitting of the Federal Parliament, and constitution and proceedings of the joint committee of the Federal Parliament shall be regulated by the rules or procedures approved by the joint sitting of both Houses of the Federal Parliament."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 105,
    "articleTitle": "Restriction on discussion",
    "articleDescription": "No discussion shall be held in either House of the Federal Parliament on any matters that may cause adverse effect on the dispensation of justice on any cases which are sub judice in any courts of Nepal and on any judicial acts done by Judges in the course of performance of their duties.",
    "articleExplanation": "Provided that nothing in this Article shall be deemed to bar the expression of opinions about the conduct of a Judge during deliberations held on a motion of impeachment."
  },
  {
    "part": "PartEight",
    "articleNumber": 106,
    "articleTitle": "Secretary General and Secretary of Federal Parliament",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The President shall appoint the Secretary General of the House of Representatives on recommendation of both the Speaker of the House of Representatives and the Chairperson of the National Assembly, the Secretary of the House of Representatives on recommendation of the Speaker, and the Secretary of the National Assembly on recommendation of the Chairperson."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The qualification, functions, duties, powers and other conditions of service of the Secretary General of the Federal Parliament, Secretary of the House of Representatives and Secretary of the National Assembly shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEight",
    "articleNumber": 107,
    "articleTitle": "Secretariat of Federal Parliament",
    "articleDescription": "There shall be a Secretariat for conducting and managing the business of the Federal Parliament. The establishment of such Secretariat and other matters related thereto shall be as provided for in the Federal law."
  },
  {
    "part": "PartEight",
    "articleNumber": 108,
    "articleTitle": "Remuneration",
    "articleDescription": "The remuneration and facilities of the Speaker and the Deputy Speaker of the House of Representatives, the Chairperson and the Vice-Chairperson of the National Assembly, chairpersons of the committees and members of the Federal Parliament shall be as provided for in the Federal law, and as specified by the Government of Nepal until such law is made."
  },
  {
    "part": "PartNine",
    "articleNumber": 109,
    "articleTitle": "Legislative powers of Federal Parliament",
    "articleDescription": "The legislative powers of the Federal Parliament shall be as enumerated in the lists of Schedule-5, Schedule-7 and Schedule-9."
  },
  {
    "part": "PartNine",
    "articleNumber": 110,
    "articleTitle": "Procedures for introduction of Bills",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A Bill may, subject to this Constitution, be introduced in any House of the Federal Parliament.",
        "clauseExtraInfo": "Provided that a Money Bill shall be introduced only in the House of Representatives."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Money Bill and a Bill concerning a security body including the Nepal Army, Nepal Police and Armed Police Force, Nepal shall be introduced only as a Government Bill."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "'Money Bill' means a Bill concerning any or all of the following subjects:",
        "clauseExtraInfo": "Provided that any Bill shall not be deemed to be a Money Bill by the reason only that it provides for the levying of any charges and fees such as license fee, application fee, renewal fee or for the imposition of fines or penalty of imprisonment.",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "the imposition, collection, abolition, remission, alteration or regulation of taxes,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "the preservation of the Federal Consolidated Fund or any other Federal Government Fund, the deposit of moneys into and the appropriation or the withdrawal of moneys from such Funds, or the reduction, increment or cancellation of appropriations or of proposed expenditures from such Funds,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "the regulation of matters relating to the borrowing of money or the giving of guarantee by the Government of Nepal, or any matter pertaining to the amendment of the law with respect to any financial obligations undertaken or to be undertaken by the Government of Nepal,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "the custody and investment of all revenues received by any Federal Government Fund, moneys acquired through the repayment of loans, and grant moneys, or accounts or audits of the accounts of the Government of Nepal, or"
          },
          {
            "subClauseLabel": "E",
            "subClauseDescription": "Other matters directly related to any of the subjects specified in clause (A), (B), (C) or (D)."
          }
        ]
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "If any question arises whether a Bill is a Money Bill or not, the decision of the Speaker thereon shall be final."
      }
    ]
  },
  {
    "part": "PartNine",
    "articleNumber": 111,
    "articleTitle": "Procedures for passage of Bills",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A Bill passed by one House of the Federal Parliament shall be transmitted to the other House as soon as possible and such Bill, if passed by the receiving House, shall be presented to the President for assent."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Money Bill passed by the House of Representatives shall be transmitted to the National Assembly. The National Assembly shall, after deliberations on such Bill, send back the Bill to the House of Representatives within fifteen days from the date of receipt of the Bill, with suggestions, if any."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The House of Representatives shall, upon deliberations on a Bill returned with suggestions under clause (2), present the Bill incorporating such suggestions as it may deem appropriate to the President for assent."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "If the National Assembly does not return a Money Bill received under clause (2) for more than fifteen days, the House of Representatives may present the Bill to the President for assent."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Any Bill, except for a Money Bill, passed by the House of Representatives and transmitted to the National Assembly shall be returned with approval or suggestions within two months from the date of receipt. If the National Assembly does not return the Bill within that period, the House of Representatives may, by a resolution passed by a majority of the total number of its existing members, present the Bill to the President for assent."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "If any Bill, other than a Money Bill, passed by one House is rejected or is passed with amendments by the other House, the Bill shall be returned to the House where it originated."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "If the House of Representatives, in considering a Bill which has been rejected or amended by the National Assembly under clause (6), passes it again as it was or with amendments, by a majority of the total number of its existing members, the Bill shall be presented to the President for assent."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "If a Bill which has been returned with amendments by the House of Representatives to the National Assembly under clause (6) is also again passed, with such amendments, by a majority of the number of existing members of the National Assembly, the Bill shall be presented to the President for assent."
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "The following Bills shall be referred to a joint sitting of the both Houses, and if the joint sitting passes the Bill as it was or with amendments, the House in which the Bill originated shall present it to the President for assent:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "Bills which, though passed by the National Assembly, have been rejected by the House of Representatives, or"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "Bills which have been returned to the National Assembly with amendments by the House of Representatives, but the National Assembly has not agreed on such amendments."
          }
        ]
      },
      {
        "clauseNumber": 10,
        "clauseDescription": "Even though the session of a House is prorogued while a Bill is under its consideration, deliberations on the Bill may continue at the succeeding session.",
        "clauseExtraInfo": "Provided that if the House of Representatives is dissolved or its term expires when any Bill introduced in the House of Representatives is under its consideration or when any Bill passed by the House of Representatives is under consideration in the National Assembly, such Bill shall lapse."
      }
    ]
  },
  {
    "part": "PartNine",
    "articleNumber": 112,
    "articleTitle": "Withdrawal of Bills",
    "articleDescription": "One who has introduced a Bill may, with the approval of the House, withdraw the Bill."
  },
  {
    "part": "PartNine",
    "articleNumber": 113,
    "articleTitle": "Assent on Bills",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A Bill which is to be submitted to the President for assent under Article 111 shall be so submitted by the Speaker or the Chairperson of the House in which the Bill originated after it has been certified by him or her.",
        "clauseExtraInfo": "Provided that in the case of a Money Bill, the Speaker shall so certify."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Bill submitted to the President for his or her assent in accordance with this Article shall be assented to within fifteen days, both Houses shall be informed thereof as soon as possible."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If the President is of the opinion that any Bill, except a Money Bill, submitted for assent needs reconsideration, he or she may, within fifty days from the date of presentation of such Bill, return the Bill with his or her message to the House in which the Bill originated."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "If any Bill is returned with a message by the President, and both Houses reconsider, passes such Bill as it was or with amendments and submit it again, the President shall give assent to that Bill within fifteen days of such submission."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "A Bill shall become an Act after the President gives assent to it."
      }
    ]
  },
  {
    "part": "PartNine",
    "articleNumber": 114,
    "articleTitle": "Provisions relating to Ordinance",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "If, at any time, except when both Houses of the Federal Parliament are in session, circumstances exist which render it necessary to take immediate action, the President may, on recommendation of the Council of Ministers, promulgate an Ordinance."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "An Ordinance promulgated under clause (1) shall have the same force and effect as an Act.",
        "clauseExplanation": "For the purposes of this clause, 'day on which a meeting of both Houses is held' means the day on which a session or meeting of both Houses of the Federal Parliament commences or is held, and this term means the later day on which a meeting of the House is held if the Houses of the Federal Parliament meet on different dates.",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "Every Ordinance shall be tabled at the session of both Houses of the Federal Parliament held after the promulgation, and if not passed by both Houses, it shall ipso facto cease to be effective,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "may be repealed at any time by the President, and"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "shall, unless rendered ineffective or repealed under sub-clause (A) or (B), ipso facto cease to be effective at the expiration of sixty days after the day on which a meeting of both Houses is held."
          }
        ]
      }
    ]
  },
  {
    "part": "PartTen",
    "articleNumber": 115,
    "articleTitle": "No tax to be levied or loan to be raised",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No tax shall be levied and collected except in accordance with law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No loan shall be raised and guarantee given by the Government of Nepal except as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartTen",
    "articleNumber": 116,
    "articleTitle": "Federal Consolidated Fund",
    "articleDescription": "Except for the revenues of trusts (Guthi), all revenues received by the Government of Nepal, all loans raised on the security of revenues, all amounts received in repayment of any loans made under the authority of any Act and any other moneys received by the Government of Nepal shall, except as otherwise provided by a Federal Act, be credited to a Government Fund to be known as the Federal Consolidated Fund."
  },
  {
    "part": "PartTen",
    "articleNumber": 117,
    "articleTitle": "Expenditures from Consolidated Fund or Government Fund",
    "articleDescription": "No expenditure shall be incurred out of the Federal Consolidated Fund or any other Federal Government Fund except the following:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "moneys charged on the Federal Consolidated Fund,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "moneys required to meet the expenditure under a Federal Appropriation Act,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "advance moneys authorized by a Federal Act required to meet expenditures, when an Appropriation Bill is under consideration, or"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "expenditures to be incurred in extraordinary circumstances under a Federal Vote of Credit Act which contains only a description of expenditures.",
        "clauseExtraInfo": "Provided that matters relating to the Federal Contingency Fund shall be governed by Article 124."
      }
    ]
  },
  {
    "part": "PartTen",
    "articleNumber": 118,
    "articleTitle": "Expenditures chargeable on Federal Consolidated Fund",
    "articleDescription": "The expenditures relating to the following matters shall be charged on the Federal Consolidated Fund, and approval of the Federal Parliament shall not be required for such expenditures:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "the amount required as remuneration and facilities of the President and the Vice-president,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "the amount required as remuneration and facilities payable to the Chief Justice of Nepal, Judges of the Supreme Court, and members of the Judicial Council,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "the amount required as remuneration and facilities payable to the Speaker and the Deputy Speaker of the House of Representatives, and the Chairperson and the Vice Chairperson of the National Assembly,"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "the amount required as remuneration and facilities payable to the chiefs and officials of the Constitutional Bodies,"
      },
      {
        "clauseNumber": "E",
        "clauseDescription": "the amount required as remuneration and facilities of the Chiefs of States,"
      },
      {
        "clauseNumber": "F",
        "clauseDescription": "the administrative expenses of the Office of the President or the Vice President, the Supreme Court, the Judicial Council, the Constitutional Bodies, and the offices of Chiefs of States,"
      },
      {
        "clauseNumber": "G",
        "clauseDescription": "all charges relating to debts for which the Government of Nepal is liable,"
      },
      {
        "clauseNumber": "H",
        "clauseDescription": "any sum required to satisfy any judgment or decree made by a court against the Government of Nepal, and"
      },
      {
        "clauseNumber": "I",
        "clauseDescription": "any other sum to be chargeable by the Federal law on the Federal Consolidated Fund."
      }
    ]
  },
  {
    "part": "PartTen",
    "articleNumber": 119,
    "articleTitle": "Estimates of revenues and expenditures",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Minister for Finance of the Government of Nepal shall, in respect of every financial year, lay before the joint sitting of both Houses of the Federal Parliament an annual estimate setting out, inter alia, the following matters:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "an estimate of revenues,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "the moneys required to meet the charges on the Federal Consolidated Fund, and"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "the moneys required to meet the expenditure to be provided for by a Federal Appropriation Act."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The annual estimate to be laid pursuant to clause (1) shall also be accompanied by a statement of the expenses allocated to every Ministry in the previous financial year and particulars of whether the objectives of the expenses have been achieved."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The Minister for Finance of the Government of Nepal shall lay before the Federal Parliament an estimate of revenues and expenditures under clause (1) on the 15th day of Jesta (mid May) each year."
      }
    ]
  },
  {
    "part": "PartTen",
    "articleNumber": 120,
    "articleTitle": "Appropriation Act",
    "articleDescription": "The moneys to be spent under an Appropriation Act shall be specified under concerned heads in an Appropriation Bill."
  },
  {
    "part": "PartTen",
    "articleNumber": 121,
    "articleTitle": "Supplementary estimates",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Minister for Finance of the Government of Nepal may lay before the House of Representatives a supplementary estimate if it is found in any financial year,-",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "that the sum authorized to be spent for a particular service by the Appropriation Act for the current financial year is insufficient, or that a need has arisen for expenditures on some new service not provided for by the Appropriation Act for that year, or"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "that the expenditures made during that financial year are in excess of the amount authorized by the Appropriation Act."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The sums included in the supplementary estimate shall be specified under the related heads in a Supplementary Appropriation Bill."
      }
    ]
  },
  {
    "part": "PartTen",
    "articleNumber": 122,
    "articleTitle": "Votes on account",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Notwithstanding anything contained elsewhere in this Part, a portion of the expenditure estimated for the financial year may, when an Appropriation Bill is under consideration, be incurred in advance, as provided for in the Federal Act."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Vote on Account Bill shall not be introduced until the estimates of revenues and expenditures have been laid in accordance with Article 119, and the sums involved in the Vote on Account shall not exceed one-third of the estimate of expenditures for the financial year."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The expenditures incurred in accordance with the Federal Vote on Account Act shall be included in the Appropriation Bill."
      }
    ]
  },
  {
    "part": "PartTen",
    "articleNumber": 123,
    "articleTitle": "Votes of credit",
    "articleDescription": "Notwithstanding anything contained elsewhere in this Part, if owing to an emergency due to either natural causes or a threat of external aggression or internal disturbances or other reasons, it appears to be impractical or inexpedient in view of the security or interest of the country to specify the details required under Article 119, the Minister for Finance of the Government of Nepal may lay before the House of Representatives a Vote of Credit Bill giving only a statement of expenditures."
  },
  {
    "part": "PartTen",
    "articleNumber": 124,
    "articleTitle": "Federal contingency fund",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A Federal Act may create a fund to be known as the contingency fund into which such moneys as may be determined by the Federal Act shall be paid from time to time."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Government of Nepal shall control the fund under clause (1), and may meet any unforeseen expenditure out of such fund."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The amount of the expenditure under clause (2) shall be reimbursed as soon as possible as provided for in the Federal Act."
      }
    ]
  },
  {
    "part": "PartTen",
    "articleNumber": 125,
    "articleTitle": "Act relating to financial procedures",
    "articleDescription": "Matters relating to the transfer of moneys appropriated by the Federal Act from one head to another and other financial procedures shall be as provided for in the Federal Act."
  },
  {
    "part": "PartEleven",
    "articleNumber": 126,
    "articleTitle": "Courts to exercise powers relating to justice",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Powers relating to justice in Nepal shall be exercised by courts and other judicial bodies in accordance with this Constitution, other laws and the recognized principles of justice."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "All shall abide by the orders or decisions made in the course of trial of lawsuits by the courts."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 127,
    "articleTitle": "Courts",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be the following courts in Nepal:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "Supreme Court,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "High Court, and"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "District Court."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "In addition to the courts under clause (1), judicial bodies may be formed at the Local level to try cases under law or other bodies as required may be formed to pursue alternative dispute settlement methods."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 128,
    "articleTitle": "Supreme Court",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a Supreme Court in Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Supreme Court shall be a court of record. All courts and judicial bodies shall, except as otherwise provided in this Constitution, be under the Supreme Court. The Supreme Court shall have the final authority to interpret this Constitution and laws."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The Supreme Court may inspect, supervise and give necessary directives to, it and courts, specialized courts or other judicial bodies under its jurisdiction, in relation to matters relating to judicial administration or management."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "All must abide by any interpretation of the Constitution or a law made by or any legal principle laid down by the Supreme Court in the course of trying a lawsuit. If anyone makes obstruction in the dispensation of justice by, or disregard any order or judgment handed down by, it or any of its subordinate courts, the Supreme Court may, in accordance with law, initiate proceedings and impose punishment for contempt."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 129,
    "articleTitle": "Appointment and qualification of Chief Justice of Nepal and Judges of Supreme Court",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Supreme Court shall consist of a maximum of twenty Judges, in addition to the Chief Justice of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The President shall appoint the Chief Justice, on recommendation of the Constitutional Council, and other Judges of the Supreme Court, on recommendation of the Judicial Council."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Any person who has served as a Judge of the Supreme Court for at least three years shall be qualified for appointment as the Chief Justice."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The term of office of the Chief Justice shall be six years."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Any citizen of Nepal who has obtained a bachelor's degree in law and served as the Chief Judge or a Judge of a High Court for at least five years or who has obtained a bachelor's degree in law and constantly practiced law as a senior advocate or advocate for at least fifteen years or who is a distinguished jurist having constantly worked for at least fifteen years in the judicial or legal field or who has served in the post of Gazetted first class or a higher post of the Judicial Service for at least twelve years shall be deemed qualified for appointment as a Judge of the Supreme Court.",
        "clauseExplanation": "The period during which one has served as the Chief Judge or Judge of an Appellate Court prior to the commencement of this Constitution shall, for the purposes of this clause, be deemed to be the period of service in the capacity of the Chief Judge or Judge of the High Court."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "If the office of the Chief Justice falls vacant or the Chief Justice is unable to carry out the duties of his or her office by reason of illness or otherwise or he or she cannot be present in the Supreme Court by reason of a leave of absence or his or her being outside of Nepal, the senior-most Judge of the Supreme Court shall act as the Acting Chief Justice."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 130,
    "articleTitle": "Conditions of service and facilities of Chief Justice and Judges",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "If the Chief Justice or a Judge of the Supreme Court who has served for at least five years resigns or undergoes compulsory retirement or dies, he or she shall be entitled to such pension as may be provided for in the Federal law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Except as otherwise provided in this Constitution, the remuneration and other conditions of service of the Chief Justice and Judges of the Supreme Court shall be provided for in the Federal law."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Notwithstanding anything contained in clauses (1) and (2), the Chief Justice or a Judge of the Supreme Court who has been removed from office by way of impeachment or who has been punished by a court for a criminal offence involving moral turpitude shall not be entitled to gratuity or pension."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The remuneration and other conditions of service of the Chief Justice or a Judge of the Supreme Court shall not be altered to his or her disadvantage.",
        "clauseExtraInfo": "Provided that this provision shall not apply in cases where a state of emergency is declared because of extreme economic disarrays."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 131,
    "articleTitle": "Vacation of office of Chief Justice or Judge of Supreme Court",
    "articleDescription": "The office of the Chief Justice or a Judge of the Supreme Court shall be vacant in any of the following circumstances:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "if he or she tenders resignation in writing before the President,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "if he or she attains the age of sixty-five years,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "if a motion of impeachment is passed against him or her under Article 101,"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "if the President removes from office the Chief Justice, on recommendation of the Constitutional Council, and the Judge of the Supreme Court, on recommendation of the Judicial Council, on the ground that he or she is unable to discharge his or her duties because of physical or mental illness,"
      },
      {
        "clauseNumber": "E",
        "clauseDescription": "if he or she is punished by a court for a criminal offence involving moral turpitude,"
      },
      {
        "clauseNumber": "F",
        "clauseDescription": "if he or she dies."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 132,
    "articleTitle": "Chief Justice and Judges of Supreme Court not to be engaged in any other office",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No Chief Justice or Judge of the Supreme Court shall be engaged in or deputed to any office other than that of Judge.",
        "clauseExtraInfo": "Provided that the Government of Nepal may, in consultation with the Judicial Council, depute a Judge of the Supreme Court to work concerning judicial inquiry, or to legal or judicial investigation or research for a specified period."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No person who has once held the office of Chief Justice or a Judge of the Supreme Court shall be eligible for appointment to any government office, except as otherwise provided in this Constitution."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 133,
    "articleTitle": "Jurisdiction of Supreme Court",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Any citizen of Nepal may file a petition in the Supreme Court to have any law or any part thereof declared void on the ground of inconsistency with this Constitution because it imposes an unreasonable restriction on the enjoyment of any fundamental right conferred by this Constitution or on any other ground, or to have any law or any part thereof made by a State Assembly declared void because it is inconsistent with any law made by the Federal Parliament or to have any law or any part thereof made by a Municipal Assembly or Village Assembly declared void because it is inconsistent with a law made by the Federal Parliament or the State Assembly, and the Supreme Court shall have an extra-ordinary power to declare that law to be void either ab initio or from the date of its decision if the law appears to be so inconsistent."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Supreme Court shall, for the enforcement of the fundamental rights conferred by this Constitution or of any other legal right for which no other remedy has been provided or for which the remedy even though provided appears to be inadequate or ineffective or for the settlement of any constitutional or legal question involved in any dispute of public interest or concern, have the extraordinary power to issue necessary and appropriate orders, provide appropriate remedies, enforce such right or settle such dispute."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Under the extra-ordinary jurisdiction under clause (2), the Supreme Court may issue appropriate orders and writs including the writs of habeas corpus, mandamus, certiorari, prohibition and quo warranto.",
        "clauseExtraInfo": "Provided that except on the ground of lack of jurisdiction, the Supreme Court shall not under this clause interfere with any internal proceedings of the Federal Parliament or State Assembly, and with any proceedings instituted by the Federal Parliament or State Assembly concerning violation of its privileges and penalties imposed therefor."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Subject to this Constitution, the Supreme Court shall, as provided in a Federal law, have the power to originally try and settle cases, hear appeals, test judgments referred for confirmation, revise cases, hear petitions or review its judgments or final orders. Judges other than those having handed down the previous judgment shall make such review."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "The Supreme Court shall settle appeals from cases originally tried and settled by a High Court and matters of public importance involving questions of interpretation of the Constitution and law or cases recommended by a High Court, accompanied by its opinion, that it is reasonable that decision be made by the Supreme Court."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "Other powers and procedures of the Supreme Court shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 134,
    "articleTitle": "Power to transfer of cases",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "If cases which involve substantially the same questions are sub judice before the Supreme Court and a High Court, and the Supreme Court is satisfied on its own or on application by the Attorney General or parties to such cases that such questions are of public importance, the Supreme Court shall have the power to procure and adjudge the cases together."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "If there exists a special situation where judicial impartiality can be questioned if a case filed in a High Court is tried by that Court, the Supreme Court may, for reasons and grounds to be recorded, order such case to be transferred from such High Court to another High Court and tried by the latter High Court, in accordance with law."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 135,
    "articleTitle": "Not to be engaged in practice of law",
    "articleDescription": "No Chief Justice or Judge of the Supreme Court may, after retirement from service, be engaged in the practice of law, mediation or arbitration proceedings before any office or court."
  },
  {
    "part": "PartEleven",
    "articleNumber": 136,
    "articleTitle": "Responsibility of Chief Justice",
    "articleDescription": "The Chief Justice shall have the ultimate responsibility to make effective the administration of justice by the Supreme Court, subordinate courts, specialized courts or other judicial bodies."
  },
  {
    "part": "PartEleven",
    "articleNumber": 137,
    "articleTitle": "Formation of Constitutional Bench",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a Constitutional Bench in the Supreme Court. The Constitutional Bench shall consist of the Chief Justice and other four Judges designated by the Chief Justice on recommendation of the Judicial Council."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Bench under clause (1) shall originally try and settle the following cases, in addition to the petitions filed in accordance with clause (1) of Article 133:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "Disputes relating to jurisdiction between the Federation and a State, between States, between a State and a Local level and between Local levels,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "Disputes relating to election to members of the Federal Parliament or State Assembly and matters relating to disqualification of a member of the Federal Parliament or of the State Assembly."
          }
        ]
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Notwithstanding anything contained in Article 133, if it appears that any case sub judice in the Supreme Court involves a question of serious constitutional interpretation, the Chief Justice may appoint such case to be tried by the Bench under clause (1)."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Other provisions relating to the functioning of the Constitutional Bench shall be as determined by the Supreme Court."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 138,
    "articleTitle": "Annual report",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Supreme Court, Judicial Council and Judicial Service Commission shall, every year, submit annual reports to the President, and the President shall submit such reports to the Federal Parliament through the Prime Minister."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "If the Federal Parliament, upon deliberating on the annual reports submitted under clause (1), deems it necessary to give any suggestion, it may give such suggestion to the concerned body through the Government of Nepal, Ministry of Law and Justice."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Other provisions relating to annual reports under clause (1) shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 139,
    "articleTitle": "High Courts",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a High Court in each State."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "If anyone makes obstruction in the dispensation of justice by, or disregard any order or judgment handed down by, it or any of its subordinate courts or judicial bodies, the High Court may initiate proceedings on and impose punishment for contempt, as provided for in the Federal law."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Each High Court shall consist of such number of Judges, in addition to the Chief Judge, as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 140,
    "articleTitle": "Appointment and qualification of Chief Judge and Judges of High Court",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Chief Justice shall, on recommendation of the Judicial Council, appoint the Chief Judge and Judges of the High Court."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Any citizen of Nepal who has obtained a bachelor's degree in law and served as a Judge of a District Court for at least five years or who has obtained a bachelor's degree in law and constantly practiced law as a senior advocate or advocate for at least ten years or who has constantly been engaged in the teaching or research of law or in any other field relation to law or justice for at least ten years or who has served in the post of at least Gazetted first class of the Judicial Service for at least five years shall be deemed qualified for appointment as the Chief Judge or a Judge of the High Court."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Appointments to the Chief Judge and Judges of a High Court shall be made from amongst the persons who have possessed the qualification under clause (2) on the basis of the proportion of cases settled by him or her annually and of evaluation of cases upheld, quashed or reversed by superior courts in the course of final decision thereof, in the case of a District Judge, and of his or her seniority, qualification and evaluation of standard of performance of business, in the case of a person who has served in the post of at least Gazetted first class of the Judicial Service, and of evaluation of seniority, professional continuity, honesty, professional conduct and contribution made to the field of law and justice, in the case of others."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "If the office of the Chief Judge falls vacant or the Chief Judge is otherwise unable to carry out the duties of his or her office or cannot be present in the High Court by reason of a leave of absence or his or her being outside of the State, the senior-most Judge of the High Court shall act as the Acting Chief Judge."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 141,
    "articleTitle": "Conditions of service and facilities of Chief Judge and Judges",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Except as otherwise provided in this Constitution, the remuneration and other conditions of service of the Chief Judge and Judges of the High Court shall be provided for in the Federal law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Notwithstanding anything contained in clause (1), the Chief Judge or a Judge of a High Court who has been removed from office upon action by the Judicial Council or upon punishment by a court for a criminal offence involving moral turpitude shall not be entitled to gratuity or pension.",
        "clauseExtraInfo": "Provided that this provision shall not apply in cases where the Judicial Council has removed him or her from office on the ground of inability to perform the duties of his or her office because of physical or mental illness."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The remuneration and other conditions of service of the Chief Judge or a Judge of the High Court shall not be altered to his or her disadvantage.",
        "clauseExtraInfo": "Provided that this provision shall not apply in cases where a state of emergency is declared because of extreme economic disarrays."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 142,
    "articleTitle": "Vacation of office of Chief Judge or Judge",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The office of Chief Judge or Judge of a High Court shall be vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she tenders resignation in writing before the Chief Justice,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if he or she attains the age of sixty-three years,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if he or she is removed from office by the Chief Justice on recommendation of the Judicial Council, on the ground of his or her incompetence, bad conduct, failure to perform his or her duties honestly, performance of business with mala fide intention or serious violation by him or her of the code of conduct required to be observed by him or her,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "if he or she is removed from office by the Chief Justice on recommendation of the Judicial Council on the ground that he or she is unable to discharge his or her duties because of physical or mental illness,"
          },
          {
            "subClauseLabel": "E",
            "subClauseDescription": "if he or she is punished by a court for a criminal offence involving moral turpitude,"
          },
          {
            "subClauseLabel": "F",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Judge who is facing a charge shall be provided with a reasonable opportunity to defend himself or herself prior to removing him or her from the office under sub-clause (3) of clause (1). The Judge against whom the proceedings have been so instituted shall not be allowed to perform the duties of his or her office until the proceedings are completed."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Nothing shall bar the institution of action in accordance with the Federal law against the Chief Judge or Judge who has been removed from office for an offence which he or she has committed while in office."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 143,
    "articleTitle": "Chief Judge and Judges not to be engaged in any other office and provisions relating to transfer",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No Chief Judge or Judge of a High Court shall be engaged in or deputed to any office other than that of Judge.",
        "clauseExtraInfo": "Provided that the Government of Nepal may, in consultation with the Judicial Council, depute a Judge of the High Court to work concerning judicial inquiry, or to legal or judicial investigation or research or to any business of national concern for any specific period."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Chief Justice may, on recommendation of the Judicial Council, transfer a Judge of a High Court to another High Court."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 144,
    "articleTitle": "Jurisdiction of High Court",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The High Court shall have the power to issue necessary and appropriate orders, for the enforcement of the fundamental rights conferred by this Constitution or for the enforcement of any other legal right for which no other remedy has been provided or for which the remedy even though provided appears to be inadequate or ineffective or for the settlement of any legal question involved in any dispute of public interest or concern,"
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "For the purposes of clause (1), the High Court may issue appropriate orders and writs including the writs of habeas corpus, mandamus, certiorari, prohibition and quo warranto.",
        "clauseExtraInfo": "Provided that except on the ground of absence of jurisdiction, the High Court shall not under this clause interfere with any internal proceedings of the Federal Parliament or State Assembly, and with any proceedings instituted by the Federal Parliament or State Assembly concerning violation of its privileges and penalties imposed therefor."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The High Court shall, in accordance with the Federal law, have the power to originally try and settle cases, hear appeals and test judgments referred for confirmation."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Other powers and procedures of the High Court shall be as provided by the Federal law."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 145,
    "articleTitle": "Power to transfer cases",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "If a High Court is of the opinion that a case which is sub judice in a subordinate court within its jurisdiction involves a question relating to a State law and it is essential to settle that question in order to decide the case, the High Court may procure the case and dispose the case wholly or decide only such question and remand the case to the court of first instance."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "If it is satisfied with the reason that there exists a situation where judicial impartiality can be questioned if a case filed in a District Court is tried by that Court, the High Court may, for reasons and grounds to be recorded, order such case to be transferred from such District Court to another District Court under its jurisdiction and tried by the latter District Court, as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 146,
    "articleTitle": "To be engaged in practice of law",
    "articleDescription": "A person who has retired from the office of a Judge of a High Court may be engaged in the practice of law before the Supreme Court and a High Court, other than the High Court where he or she has served as a Judge and a subordinate court."
  },
  {
    "part": "PartEleven",
    "articleNumber": 147,
    "articleTitle": "Responsibility of Chief Judge",
    "articleDescription": "The Chief Judge shall have the ultimate responsibility to make effective the administration of justice by the High Court and the Courts or other judicial bodies which are subordinate to it. For that purpose, the Chief Judge may, subject to this Constitution and the Federal law, give necessary direction to the subordinate Courts and judicial bodies."
  },
  {
    "part": "PartEleven",
    "articleNumber": 148,
    "articleTitle": "District Courts",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a District Court in each District."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Local level judicial bodies established in accordance with the State law shall be subordinate to the District Court. The District Court may inspect as well as supervise and give necessary direction to its subordinate judicial bodies."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 149,
    "articleTitle": "Appointment, qualification, remuneration and other conditions of service of Judges of District Courts",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Chief Justice shall, on recommendation of the Judicial Council, appoint Judges of the District Courts."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The vacant posts of Judges of the District Court shall be filled as follows:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "twenty percent of the vacant posts, on the basis of evaluation of seniority, qualification and competency, from amongst the officers who have obtained bachelor's degree in law and served for at least three years in the post of Gazetted Second Class of the Judicial Service,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "forty percent of the vacant posts, on the basis of open competitive examination, from amongst the officers who have obtained bachelor's degree in law and served for at least three years in the post of Gazetted Second Class of the Judicial Service,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "the remaining forty percent of the vacant posts, on the basis of open competitive examination, from amongst the citizens of Nepal who, having obtained bachelor's degree in law, have constantly practiced law for at least eight years as an advocate or who, having obtained bachelor's degree in law, have served in a Gazetted post of the Judicial Service for at least eight years or have constantly been engaged in the teaching or research of law or served in any other field of law or justice for at least eight years."
          }
        ]
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The Judicial Service Commission shall, in accordance with the Federal law, hold written and oral competitive examinations for the persons who have possessed the qualification under sub-clauses (B) and (C) of clause (2), and make recommendation, in order of merit, to the Judicial Council for appointment as District Judges."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The remuneration and other conditions of service of the Judges of the District Court shall be provided for in the Federal law."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "The remuneration and other conditions of service of a Judge of the District Court shall not be altered to his or her disadvantage.",
        "clauseExtraInfo": "Provided that this provision shall not apply in cases where a state of emergency is declared because of extreme economic disarrays."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The office of a Judge of the District Court shall be vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she tenders resignation in writing before the Chief Justice,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if he or she attains the age of sixty-three years,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if he or she is removed from office by the Chief Justice on recommendation of the Judicial Council, on the ground of his or her incompetence, misconduct, failure to perform his or her duties honestly, performance of business with mala fide intention or serious violation by him or her of the code of conduct required to be observed by him or her,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "if he or she is removed from office by the Chief Justice on recommendation of the Judicial Council on the ground that he or she is unable to continue service and discharge his or her duties because of physical or mental illness,"
          },
          {
            "subClauseLabel": "E",
            "subClauseDescription": "if he or she is punished by a court for a criminal offence involving moral turpitude,"
          },
          {
            "subClauseLabel": "F",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "A District Judge who is accused shall be given a reasonable opportunity to defend himself or herself before removing him or her from office under sub-clause (c) of clause (6). The District Judge against whom the proceedings are so initiated shall not perform the duties of his or her office until the proceedings are completed."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "Nothing shall prevent the instituting of action, in accordance with the Federal law, against a District Judge who is removed from office for an offence which he or she has committed while in office."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 150,
    "articleTitle": "District Judges not to be engaged in any other office and provisions relating to transfer",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No District Judge shall be engaged in or deputed to any office other than that of Judge.",
        "clauseExtraInfo": "Provided that the Government of Nepal may, in consultation with the Judicial Council, depute a District Judge to work concerning judicial inquiry, or to legal or judicial investigation or research and to any election related work, for a specified period."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Chief Justice may, on recommendation of the Judicial Council, transfer a District Judge from one District Court to another District Court."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 151,
    "articleTitle": "Jurisdiction of District Court",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Except as otherwise provided by the Federal law, a District Court shall have the power to originally try and settle all cases under its jurisdiction, to try petitions under law, including petitions of habeas corpus and prohibition, hear appeals under law from decisions made by quasi-judicial bodies, hear appeals from decisions made by Local level judicial bodies formed under the State law, institute contempt proceedings and punish for contempt under the Federal law if anyone makes obstruction in the dispensation of justice by, or disregards any order or judgment by, it or any of its subordinate courts."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Other provisions relating to the jurisdiction and procedures of the District Courts shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 152,
    "articleTitle": "Specialized courts",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Other specialized courts, judicial bodies or tribunals may be formed to try and settle specific types and nature of cases other than those mentioned in Article 127, as provided for in the Federal law.",
        "clauseExtraInfo": "Provided that no specialized court, judicial body or tribunal shall be formed for any specific case."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No criminal offence involving imprisonment for a term of more than one year shall fall under the jurisdiction of a body other than a court, specialized court, military court or judicial body."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 153,
    "articleTitle": "Judicial Council",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a Judicial Council to make recommendation or give advice, in accordance with this Constitution, on the appointment of, transfer of, disciplinary action against, and dismissal of, Judges, and other matters relating to the administration of justice, which shall consist of the following as its chairperson and members:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "The Chief Justice - Chairperson"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "The Federal Minister for Law and Justice - Member"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "The senior-most Judge of the Supreme Court - Member"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "One jurist nominated by the President on recommendation of the Prime Minister - Member"
          },
          {
            "subClauseLabel": "E",
            "subClauseDescription": "A senior advocate or advocate who has gained at least twenty years of experience, to be appointed by the President on recommendation of the Nepal Bar Association - Member"
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The term of office of the members under sub-clauses (D) and (E) of clause (1) shall be four years, and their remuneration and facilities shall be equivalent to those of a Judge of the Supreme Court."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The members under sub-clauses (D) and (E) of clause (1) shall be removed from office in the same manner and on the same grounds as a Judge of the Supreme Court."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The chairperson and a member of the Judicial Council may study the case associated with a complaint filed in respect of any Judge, and make a report thereof to the Judicial Council."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "If a preliminary inquiry of a complaint filed in respect of any Judge reveals a need to have a detailed inquiry by an expert, the Judicial Council may form an inquiry committee."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "If a Judge, other than a Judge who can be removed from office by way of impeachment in accordance with this Constitution, commits an abuse of authority by way of corruption, the Judicial Council may investigate into the matter and institute a case in accordance with law."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "The Judicial Council must prepare updated records of the persons who are qualified for appointment to offices of the Chief Justice, Judges of the Supreme Court, Chief Judges and Judges of the High Courts."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "Other functions, duties and powers of the Judicial Council shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 154,
    "articleTitle": "Judicial Service Commission",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "In appointing, transferring or promoting gazetted officers of the Federal Judicial Service or taking departmental action concerning such officers in accordance with law, the Government of Nepal shall act on recommendation of the Judicial Service Commission.",
        "clauseExtraInfo": "Provided that in making new permanent appointments to gazetted posts of the Federal Judicial Service from persons who are not already in the Federal Government Service or making promotions from non-gazetted posts of the Federal Judicial Service to gazetted ones of that Service, the Government of Nepal shall act on the recommendation of the Public Service Commission.",
        "clauseExplanation": "For the purposes of this Article, the Public Service Commission shall hold open and internal competitive examinations to be held for appointments to Gazetted posts of the Federal Judicial Service."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Judicial Service Commission shall consist of the following as its chairperson and members:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "The Chief Justice - Chairperson"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "The Federal Minister for Law and Justice - Member"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "The seniormost Judge of the Supreme Court - Member"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "The Chairperson of the Public Service Commission - Member"
          },
          {
            "subClauseLabel": "E",
            "subClauseDescription": "The Attorney General - Member"
          }
        ]
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Other functions, duties, powers and procedures of the Judicial Service Commission shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEleven",
    "articleNumber": 155,
    "articleTitle": "Provisions relating to conditions of service and facilities",
    "articleDescription": "Provisions relating to the remuneration, facilities and conditions of service of the employees of the Federal Judicial Service shall be as provided for in the Federal Act."
  },
  {
    "part": "PartEleven",
    "articleNumber": 156,
    "articleTitle": "Provisions relating to State Judicial Service Commission",
    "articleDescription": "Provisions relating to the formation of a State Judicial Service Commission and the remuneration, facilities and conditions of service of the employees of a State Judicial Service shall be as provided for in the Federal law."
  },
  {
    "part": "PartTwelve",
    "articleNumber": 157,
    "articleTitle": "Attorney General",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be an Attorney General of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The President shall, on recommendation of the Prime Minister, appoint the Attorney General. The Attorney General shall hold office during the pleasure of the Prime Minister."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "A person who is qualified to be appointed as a Judge of the Supreme Court shall be eligible to be appointed as the Attorney General."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The office of the Attorney General shall be vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she tenders resignation in writing to the President through the Prime Minister,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if he or she is removed from office by the President on recommendation of the Prime Minister,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "The remuneration and other facilities of the Attorney General shall be similar to those of a Judge of the Supreme Court. Other conditions of service of the Attorney General shall be in accordance with law."
      }
    ]
  },
  {
    "part": "PartTwelve",
    "articleNumber": 158,
    "articleTitle": "Functions, duties and powers of Attorney General",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Attorney General shall be the chief legal advisor to the Government of Nepal. It shall be the duty of the Attorney General to give opinions and advices on constitutional and legal matters to the Government of Nepal and such other authorities as the Government of Nepal may specify."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Attorney General or government attorneys subordinate to him or her shall represent the Government of Nepal in lawsuits wherein the rights, interests or concerns of the Government of Nepal are involved. Except as provided otherwise in this Constitution, the Attorney General shall have the right to make a final decision as to whether to institute any case on behalf of the Government of Nepal in any court, judicial body or authority."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Opinion of the Attorney General must be obtained for withdrawing a case filed on behalf of the Government of Nepal."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The Attorney General may, upon invitation by the Federal Parliament or any of its committees, to appear and express his or her opinion on any legal question in such a meeting."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "In the course of discharging the duties of his or her office, the Attorney General shall have the right to appear in any Court, office and authority of Nepal."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The Attorney General shall, in the course of performing his or her duties, have the power to carry out the following acts, in addition to that set forth in clause (2):",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "to defend, on behalf of the Government of Nepal, any lawsuit in which the Government of Nepal is a plaintiff or a defendant,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "to monitor, or cause to be monitored, whether any interpretation given to a law or any legal principle laid down by the Supreme Court in the course of hearing of lawsuits has been implemented,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if a complaint is made alleging that any person held in custody has not been treated humanely subject to this Constitution or such person has not been allowed to meet his or her relative or through his or her legal practitioner or if information of such matter is received, to inquire thereinto and give necessary directive to the concerned authority to prevent such act."
          }
        ]
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "The Attorney General may so delegate his or her functions, duties and powers under this Article to his or her subordinate government attorneys as to be exercised and complied with subject to the specified conditions."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "In addition to the functions, duties and powers mentioned in this Article, other functions, duties and powers of the Attorney General shall be pursuant to this Constitution and the Federal law."
      }
    ]
  },
  {
    "part": "PartTwelve",
    "articleNumber": 159,
    "articleTitle": "Annual report",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Attorney General shall, every year, submit to the President an annual report on the works which he or she has performed pursuant to this Constitution and the Federal law, and the President shall cause such report to be laid before the Federal Parliament through the Prime Minister."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The annual report to be submitted pursuant to clause (1) shall set out, inter alia, the number of advices and opinions on constitutional and legal matters rendered by him or her throughout the year, and short description of such advices and opinions, details of cases instituted as state cases, details of defence made in lawsuits in which the Government of Nepal is a plaintiff or defendant, details of reforms to be made in the future in relation to cases to be instituted as state cases and information relating to crime trends."
      }
    ]
  },
  {
    "part": "PartTwelve",
    "articleNumber": 160,
    "articleTitle": "Chief Attorney",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a Chief Attorney in every State, who shall be subordinate to the Attorney General."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Chief of State shall, on recommendation of the concerned Chief Minister, appoint the Chief Attorney. The Chief Attorney shall hold office during the pleasure of the Chief Minister."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "A person who is qualified to be appointed as a Judge of High Court shall be eligible to be appointed as the Chief Attorney."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The office of the Chief Attorney shall be vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she tenders resignation in writing to the Chief of State through the Chief Minister,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if he or she is removed from office by the Chief of State on recommendation of the Chief Minister,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "The Chief Attorney shall be the chief legal advisor to the State Government. It shall be the duty of the Chief Attorney to give opinions and advices on constitutional and legal matters to the State Government and such other authorities as the State Government may specify."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The Office of Attorney General shall manage the employees under the Office of Chief Attorney."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "The remuneration and other facilities of the Chief Attorney shall be similar to those of a Judge of High Court. The functions, duties and powers and other conditions of service of the Chief Attorney shall be as provided for in the State law."
      }
    ]
  },
  {
    "part": "PartTwelve",
    "articleNumber": 161,
    "articleTitle": "Provisions relating to conditions of service and facilities",
    "articleDescription": "Provisions relating to the remuneration, facilities and conditions of service of the government attorneys and other employees under the Attorney General shall be as provided for in the Federal Act."
  },
  {
    "part": "PartThirteen",
    "articleNumber": 162,
    "articleTitle": "Executive power of State",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The executive power of a State shall, pursuant to this Constitution and the State law, be vested in the State Council of Ministers.",
        "clauseExtraInfo": "Provided that if a State Executive does not exist because of enforcement of Federal governance, the Chief of State shall exercise the executive power of the State as directed by the Government of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The responsibility for issuing general directives, controlling and regulating the governance of the State shall, subject to this Constitution and other laws, lie in the State Council of Ministers."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "All State executive functions shall be performed in the name of the State Government."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The executive power of the State shall be as mentioned in Schedule-6, Schedule-7 and Schedule-9 subject to this Constitution.",
        "clauseExtraInfo": "Provided that the State Council of Ministers shall exercise the executive powers in coordination with the Government of Nepal, except as explicitly mentioned in this Constitution and in the Federal law in relation to concurrent powers of the Federation and the State."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Any decision or order to be issued in the name of the State Government pursuant to clause (3) and other instruments of authorization pertaining thereto shall be authenticated as provided for in the State law."
      }
    ]
  },
  {
    "part": "PartThirteen",
    "articleNumber": 163,
    "articleTitle": "Provisions relating to Chief of State",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a Chief of State in each State, as a representative of the Government of Nepal."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The President shall appoint one Chief of State for each State."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The term of office of a Chief of State shall be five years except where the President removes him or her from office prior to the expiration of his or her term of office."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "A person may not be the Chief of State for more than once in the same State."
      }
    ]
  },
  {
    "part": "PartThirteen",
    "articleNumber": 164,
    "articleTitle": "Qualification for Chief of State",
    "articleDescription": "A person who has the following qualification shall be qualified to become the Chief of State:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "being qualified for being a member of the Federal Parliament,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "having completed the age of thirty five years, and"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "Not being disqualified by any law."
      }
    ]
  },
  {
    "part": "PartThirteen",
    "articleNumber": 165,
    "articleTitle": "Vacation of office of Chief of State",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The office of the Chief of State shall become vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she tenders resignation in writing to the President,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if his or her term of office expires and he or she is removed from office by the President prior to expiration of the term,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "If the office of the Chief of State of any State falls vacant, the President may so designate the Chief of State of another State to act as such also for such State."
      }
    ]
  },
  {
    "part": "PartThirteen",
    "articleNumber": 166,
    "articleTitle": "Functions, duties and powers of Chief of State",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Chief of State shall exercise such powers and perform such duties as conferred to him or her pursuant to this Constitution or law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "In exercising the powers or duties under clause (1), the Chief of State shall perform all other functions to be performed by him or her on recommendation and with the consent of the State Council of Ministers than those functions specifically provided to be performed on recommendation of any body or official pursuant to this Constitution or law. Such recommendation and consent shall be submitted through the Chief Minister."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Any decision or order to be issued in the name of the Chief of State under clause (2) and other instrument of authorization pertaining thereto shall be authenticated as provided for in the State law."
      }
    ]
  },
  {
    "part": "PartThirteen",
    "articleNumber": 167,
    "articleTitle": "Oath by Chief of State",
    "articleDescription": "The Chief of State shall, prior to assuming office, take an oath of office and secrecy before the President, as provided for in the Federal law."
  },
  {
    "part": "PartThirteen",
    "articleNumber": 168,
    "articleTitle": "Constitution of State Council of Ministers",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Chief of State shall appoint the leader of the parliamentary party commanding a majority in the State Assembly as the Chief Minister, and the State Council of Ministers shall be constituted under his or her chairpersonship."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "In cases where no party has a clear majority in the State Assembly under clause (1), the Chief of State shall appoint as the Chief Minister a member of the State Assembly who can command majority with the support of two or more parties representing to the State Assembly."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "In cases where the Chief Minister cannot be appointed under clause (2) no later than thirty days after the date of declaration of the final results of election to the State Assembly or the Chief Minister so appointed fails to secure a vote of confidence under clause (4), the Chief of State shall appoint as the Chief Minister the parliamentary party leader of the party which has the highest number of members in the State Assembly."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The Chief Minister appointed under clause (2) or (3) shall obtain a vote of confidence from the State Assembly no later than thirty days after the date of such appointment."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "In cases where the Chief Minister appointed under clause (3) fails to obtain a vote of confidence under clause (4) and any member under clause (2) presents a ground on which he or she can obtain a vote of confidence in the State Assembly, the Chief of State shall appoint such a member as the Chief Minister."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The Chief Minister appointed under clause (5) must obtain a vote of confidence under clause (4)."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "In cases where the Chief Minister appointed under clause (5) fails to obtain a vote of confidence or the Chief Minister cannot be appointed, the Chief of State shall, on recommendation of the Chief Minister, dissolve the State Assembly and appoint a date of election so that the election to another State Assembly is completed within six months."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "Procedures on the appointment of the Chief Minister under this Article must be completed no later than thirty five days after the date of declaration of the final results of election to the State Assembly held under this Constitution or the date on which the office of the Chief Minister has fallen vacant."
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "The Chief of State shall, on recommendation of the Chief Minister, constitute the State Council of Ministers consisting of a maximum of twenty percent of the total number of members of the State Assembly, including the Chief Minister, in accordance with the inclusive principle, from amongst the members of the State Assembly.",
        "clauseExplanation": "For the purposes of this Article, 'Minister' means a Minister, Minister of State and Assistant Minister."
      },
      {
        "clauseNumber": 10,
        "clauseDescription": "The Chief Minister and Ministers shall be collectively responsible to State Assembly, and the Ministers shall be individually responsible for the work of their respective Ministries to the Chief Minister and the State Assembly."
      }
    ]
  },
  {
    "part": "PartThirteen",
    "articleNumber": 169,
    "articleTitle": "Vacation of office of Chief Minister and Minister",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The office of the Chief Minister shall be vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she tenders resignation in writing to the Chief of State,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if a vote of no-confidence is passed against him or her under Article 188 or a vote of confidence is not passed,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if he or she ceases to be a member of the State Assembly,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The office of a Minister shall be vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she tenders resignation in writing to the Chief Minister,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if the Chief Minister removes him or her from office,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if the office of the Chief Minister falls vacant under sub-clause (A), (B) or (C) of clause (1),"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Even though the office of the Chief Minister falls vacant under clause (1), the same Council of Ministers shall continue to act until another State Council of Ministers is constituted.",
        "clauseExtraInfo": "Provided that if the Chief Minister dies, the senior-most Minister shall act as the Chief Minister until a new Chief Minister is appointed."
      }
    ]
  },
  {
    "part": "PartThirteen",
    "articleNumber": 170,
    "articleTitle": "Appointment of non-member of State Assembly as Minister",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Notwithstanding anything contained in clause (9) of Article 168, the Chief of State may, on the recommendation of the Chief Minister, appoint any person who is not a member of the State Assembly as a Minister."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Minister appointed under clause (1) must obtain membership of the State Assembly within six months from the date of taking an oath by him or her."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "In the event of failure to obtain membership of the State Assembly within the period mentioned in clause (2), he or she shall not be eligible to be reappointed to the office of Minister during the term of the then State Assembly."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Notwithstanding anything contained in clause (1), a person who has been defeated in the election to the then State Assembly shall be not eligible to be appointed to the office of Minister under clause (1) during the term of such State Assembly."
      }
    ]
  },
  {
    "part": "PartThirteen",
    "articleNumber": 171,
    "articleTitle": "Remuneration and other Facilities of Chief Minister and Minister",
    "articleDescription": "The remuneration and other facilities of the Chief Minister and Ministers shall be as provided by a State Act, and until such Act is made, shall be as specified by the State Government."
  },
  {
    "part": "PartThirteen",
    "articleNumber": 172,
    "articleTitle": "Oath",
    "articleDescription": "The Chief Minister and Ministers shall, before assuming their respective offices, take an oath of office and secrecy before the Chief of State, and Ministers of State and Assistant Ministers, before the Chief Minister, as provided for in the State law."
  },
  {
    "part": "PartThirteen",
    "articleNumber": 173,
    "articleTitle": "To give information to Chief of State",
    "articleDescription": "The Chief Minister shall inform the Chief of State about the following matters:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "resolutions of the State Council of Ministers,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "Bills to be introduced in the State Assembly,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "such other necessary information as commanded by the Chief of State on matters set forth in clauses (A) and (B), and"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "current general state of affairs of the State."
      }
    ]
  },
  {
    "part": "PartThirteen",
    "articleNumber": 174,
    "articleTitle": "Transaction of business of State Government",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The allocation and transaction of business of the State Government shall be carried out in accordance with the rules approved by the State Government."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No question shall be raised in any court as to whether or not the rules under clause (1) have been observed."
      }
    ]
  },
  {
    "part": "PartFourteen",
    "articleNumber": 175,
    "articleTitle": "State Legislature",
    "articleDescription": "The legislature of a State shall be unicameral, which shall be called as the State Assembly."
  },
  {
    "part": "PartFourteen",
    "articleNumber": 176,
    "articleTitle": "Composition of State Assembly",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Each State Assembly shall consist of a number of members, as follows:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "Members in a number that is twice as many as the number of members elected to the House of Representatives from the concerned State, through the first past the post electoral system,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "The number of members to be set under clause (A) shall be considered to be sixty percent, and the rest forty percent members to be elected, through the proportional electoral system."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Election constituencies shall be set on the basis of geography and population as provided for in the Federal law, for the election to members under sub-clause (A) of clause (1)."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Sixty percent members of the State Assembly shall be elected in accordance with the first past the post electoral system and the forty percent members in accordance with the proportional electoral system."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Election to the members of the State Assembly under clause (3) shall be held through adult suffrage by secret ballots in accordance with law."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Each citizen of Nepal who resides within the territory of the State and who has completed the age of eighteen years shall have a right to vote in any one election constituency in accordance with law."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The Federal law shall provide that, in fielding candidacy by political parties for the election to the State Assembly under the proportional electoral system, representation shall be ensured on the basis of a closed list also from women, Dalit, indigenous, indigenous nationalities, Khas Arya, Madhesi, Tharu, Muslims and backward regions, minority communities, on the basis of population. In so fielding candidacy, regard shall also be had to geographical balance of the concerned State.",
        "clauseExplanation": "For the purposes of this clause, 'Khas Arya' means Kshetri, Brahmin, Thakuri, Sanyasi (Dashnami) community."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "In fielding candidacy under clause (6), political parties must provide for representation of the persons with disabilities as well."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "If the seat of a member of the State Assembly falls vacant while its term still remains for more than six months, the vacancy shall be filled through the same electoral system as through which such seat was filled in."
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "Notwithstanding anything contained elsewhere in this Article, at least one third of the total number of members elected from each political party representing in the State Assembly must be women. If women are not so elected as to constitute one third of the elected members of any political party under sub-clause (A) of clause (1), such political party must, in electing members under sub-clause (B) of that clause, so elect that women members constitute at least one third of the total number of members elected to the State Assembly from that party."
      },
      {
        "clauseNumber": 10,
        "clauseDescription": "A person who is qualified under Article 178 and entitled to vote in an election to the members of the State Assembly may, subject to law, be a candidate in any election constituency of the State.",
        "clauseExtraInfo": "Provided that a person shall not be a candidate in more than one election constituencies at the same time."
      },
      {
        "clauseNumber": 11,
        "clauseDescription": "Other provisions relating to election to the State Assembly shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartFourteen",
    "articleNumber": 177,
    "articleTitle": "Term of State Assembly",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Unless dissolved earlier pursuant to this Constitution, the term of the State Assembly shall be five years."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Notwithstanding anything contained in clause (1), the term of the State Assembly may be extended by a State Act for a period not exceeding one year in cases where a proclamation or order of a state of emergency is in effect."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The term of the State Assembly extended under clause (2) shall ipso facto be terminated after the expiry of six months from the date of voidance of the proclamation or order of the state of emergency in the concerned State."
      }
    ]
  },
  {
    "part": "PartFourteen",
    "articleNumber": 178,
    "articleTitle": "Qualification for member of State Assembly",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A person who has the following qualification shall be qualified to become a member of the State Assembly:",
        "clauseExplanation": "For the purposes of this clause, 'office of profit' means any position, other than a political position which is to be filled by election or nomination, for which a remuneration or economic benefit is paid out of a government fund.",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "being a citizen of Nepal,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "being a voter of the concerned State,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "having completed the age of twenty five years,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "not having been convicted of a criminal offense involving moral turpitude,"
          },
          {
            "subClauseLabel": "E",
            "subClauseDescription": "not being disqualified by any law, and"
          },
          {
            "subClauseLabel": "F",
            "subClauseDescription": "not holding any office of profit."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "If a person who holds a political office to be filled by way of election, nomination or appointment is elected as a member of the State Assembly under this Part, his or her such office shall ipso facto be vacant with effect from the day on which he or she takes an oath of such office."
      }
    ]
  },
  {
    "part": "PartFourteen",
    "articleNumber": 179,
    "articleTitle": "Oath of member of State Assembly",
    "articleDescription": "Every member of the State Assembly must, before taking part for the first time in the meeting of the Assembly or any of its committees, take an oath as provided for in the State law."
  },
  {
    "part": "PartFourteen",
    "articleNumber": 180,
    "articleTitle": "Vacation of seat of member of State Assembly",
    "articleDescription": "The seat of a member of the State Assembly shall become vacant in any of the following circumstances:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "if he or she tenders resignation in writing before the Speaker of the State Assembly,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "if he or she is no longer qualified or ceases to possess the qualification under Article 178,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "if the term of the State Assembly expires or it is dissolved,"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "if he or she absents himself or herself from ten consecutive meetings, without giving notice to the State Assembly,"
      },
      {
        "clauseNumber": "E",
        "clauseDescription": "if the political party of which he or she was a member when elected provides a notification as provided for in the Federal law that he or she has defected from the party,"
      },
      {
        "clauseNumber": "F",
        "clauseDescription": "If he or she dies."
      }
    ]
  },
  {
    "part": "PartFourteen",
    "articleNumber": 181,
    "articleTitle": "Decision as to disqualification of member",
    "articleDescription": "If a question arises as to whether any member of the State Assembly is disqualified or has ceased to possess any of the qualifications under Article 178, the Constitutional Bench of the Supreme Court shall make the final decision of such question."
  },
  {
    "part": "PartFourteen",
    "articleNumber": 182,
    "articleTitle": "Speaker and Deputy Speaker of State Assembly",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The members of the State Assembly shall, not later than fifteen days of the date of holding of the first meeting of the State Assembly, elect a State Speaker and a Deputy State Speaker from amongst themselves."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "Election under clause (1) shall be so held that there is one woman out of the State Speaker and the Deputy State Speaker, and the State Speaker and the Deputy State Speaker of the State Assembly shall be representatives from different parties.",
        "clauseExtraInfo": "Provided that if there is no representation of more than one party in the State Assembly or no candidacy is filed by more than one party despite representation, nothing shall prevent the members of the same party from being the State Speaker and the Deputy State Speaker of the State Assembly."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If the office of the State Speaker or the Deputy State Speaker falls vacant, the members of the State Assembly shall fill the vacancy through election to the State Speaker or the Deputy State Speaker from amongst themselves."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The Deputy State Speaker shall, in the absence of the State Speaker of the State Assembly, chair the State Assembly."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "If the election to the State Speaker and the Deputy State Speaker has not taken place, or if both the positions have become vacant, the attending member who is by age the senior-most shall chair the meeting of the State Assembly."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The office of the State Speaker or the Deputy State Speaker of the State Assembly shall become vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if he or she ceases to be a member of the State Assembly,",
            "subClauseExtraInfo": "Provided that, in the event of the dissolution of the State Assembly, the State Speaker and the Deputy State Speaker of the State Assembly holding their respective offices shall continue in office until the previous day of the filing of nominations for another election to the State Assembly,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if he or she resigns in writing,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if a resolution is passed by a majority of two-thirds of the total number of the then members of the State Assembly to the effect that his or her conduct is not compatible with his or her office."
          }
        ]
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "The State Deputy Speaker shall preside over a meeting at which deliberations are to be held on a motion that the conduct of the Speaker of the State Assembly is not compatible with his or her office. The State Speaker shall be entitled to take part and vote in the deliberations on such motion."
      }
    ]
  },
  {
    "part": "PartFourteen",
    "articleNumber": 183,
    "articleTitle": "Summoning and prorogation of session of State Assembly",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Chief of State shall summon a session of the State Assembly within twenty days of the declaration of final results of the election to the State Assembly. Thereafter, the Chief of State shall, from time to time, summon other sessions pursuant to this Constitution.",
        "clauseExtraInfo": "Provided that the interval between the two consecutive sessions shall not exceed six months."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Chief of State may prorogue the sessions of the State Assembly."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If, during the prorogation or recess of the session of the State Assembly, one-fourth of the total number of its members make a petition that it is expedient to convene a session or meeting, the Chief of State shall specify the date and time for such session or meeting. The State Assembly shall meet or commence its session at the date and time so specified."
      }
    ]
  },
  {
    "part": "PartFourteen",
    "articleNumber": 184,
    "articleTitle": "Address by Chief of State",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Chief of State may address a sitting of the State Assembly, and summon the members for that purpose."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Chief of State shall address the first session after an election to the State Assembly and a sitting of the State Assembly after the commencement of the first session of each year."
      }
    ]
  },
  {
    "part": "PartFourteen",
    "articleNumber": 185,
    "articleTitle": "Quorum of State Assembly",
    "articleDescription": "Except as otherwise provided for in this Constitution, no question or motion shall be presented for decision in the State Assembly unless one-fourth of the total number of its members are present."
  },
  {
    "part": "PartFourteen",
    "articleNumber": 186,
    "articleTitle": "Voting in State Assembly",
    "articleDescription": "All questions submitted for decision in the State Assembly shall be decided by a majority vote of the members present and participate in voting. The member chairing the meeting shall not have the right to vote.",
    "articleExtraInfo": "Provided that he or she may exercise his or her casting vote in the case of a tie."
  },
  {
    "part": "PartFourteen",
    "articleNumber": 187,
    "articleTitle": "Privileges of State Assembly",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be full freedom of speech in the State Assembly, subject to this Constitution, and no member shall be arrested, detained or prosecuted in any court for anything expressed or any vote cast by him or her in the State Assembly."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The State Assembly shall, subject to this Constitution, have full power to regulate and decide its internal business, and it shall be the exclusive right of the State Assembly to decide whether or not any of its proceedings is regular or irregular. No question shall be raised in any court in this behalf."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "No comment shall be made about the good faith concerning any proceeding of the State Assembly, and no publication and broadcasting of any kind shall be made about anything said by any member, intentionally distorting or misinterpreting the meaning of the speech."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The provisions of clauses (1) and (3) shall also apply to other persons who are entitled to participate in the meetings of the State Assembly than the members of State Assembly."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "No proceedings shall be initiated in any court against any person in respect of the publication, under the authority granted by the State Assembly, of any document, report, vote or proceeding.",
        "clauseExplanation": "For the purposes of this clause and clauses (1), (2), (3) and (4), 'State Assembly' means and includes the meeting of a committee of the State Assembly."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "No member of the State Assembly may be arrested during the period from the issuance of a notice summoning the session to its prorogation.",
        "clauseExtraInfo": "Provided that nothing in this clause shall be deemed to prevent the arrest under the law of any member on a criminal charge. If any member is so arrested, the authority making such arrest shall forthwith give information thereof to the person presiding over the State Assembly."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "Any breach of the privileges shall be deemed to constitute contempt of the State Assembly, and the State Assembly shall have the exclusive right to decide whether any breach of its privileges has taken place."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "If any person is in contempt of the State Assembly, the person presiding over the State Assembly may, after a decision by the State Assembly to that effect, admonish, warn or impose a sentence of imprisonment for a term not exceeding three months or of a fine not exceeding ten thousand rupees on such person, and such fine shall be recovered as a government due.",
        "clauseExtraInfo": "Provided that if such a person submits an apology to the satisfaction of the State Assembly, it may either pardon him or her or remit or commute the sentence imposed on him or her."
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "Other matters relating to privileges of the State Assembly shall be as provided in the State law."
      }
    ]
  },
  {
    "part": "PartFourteen",
    "articleNumber": 188,
    "articleTitle": "Provisions relating to vote of confidence and motion of no-confidence",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Chief Minister may, whenever he or she considers necessary or appropriate to show that he or she has confidence from the State Assembly, table a resolution to that effect in the State Assembly for the vote of confidence."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "If the political party which the Chief Minister represents is divided or a political party in coalition State Government withdraws its support, the Chief Minister shall table a resolution in the State Assembly for a vote of confidence within thirty days."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "If a resolution tabled under clauses (1) and (2) is not passed by a majority of the total number of then members of the State Assembly, the Chief Minister shall relieve of his or her office."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "One-fourth of the total number of then members of the State Assembly may table in writing a motion of no-confidence against the Chief Minister.",
        "clauseExtraInfo": "Provided that a motion of no confidence may not be tabled until the first two years after the appointment of the Chief Minister and until another one year after the date of failure of the motion of no confidence once tabled."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "A motion of no confidence to be tabled under clause (4) shall also indicate the name of a member proposed for Chief Minister."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "If a motion of no confidence tabled under clause (4) is passed by a majority of the total number of then members of the State Assembly, the Chief Minister shall relieve of his or her office."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "If the office of the Chief Minister falls vacant because of the passage of a vote of no-confidence under clause (6), the Chief of State shall, in accordance with Article 168, appoint as the Chief Minister the member of the State Assembly proposed under clause (5)."
      }
    ]
  },
  {
    "part": "PartFourteen",
    "articleNumber": 189,
    "articleTitle": "Minister, Minister of State and Assistant Minister entitled to take part in meetings of State Assembly",
    "articleDescription": "The Minister, Minister of State and Assistant Minister shall be entitled to attend, and take part in the proceedings and deliberations of, the State Assembly or its committees.",
    "articleExtraInfo": "Provided that a Minister, Minister of State or Assistant Minister who is not a member of the State Assembly shall not be entitled to vote in a meeting of the State Assembly or its committee, and a Minister, Minister of State or Assistant Minister shall not be entitled to vote in a meeting of a committee of which he or she is not a member."
  },
  {
    "part": "PartFourteen",
    "articleNumber": 190,
    "articleTitle": "Penalty for unauthorized presence or voting in State Assembly",
    "articleDescription": "If a person who has not taken oath under Article 179 or who is not a member of the State Assembly is present or votes in a meeting of the State Assembly or of its committee as a member, the person shall, by order of the person chairing the meeting, be fined with a sum of five thousand rupees for each instance of such presence or voting, and such a fine shall be recovered as a government due."
  },
  {
    "part": "PartFourteen",
    "articleNumber": 191,
    "articleTitle": "Restriction on discussion",
    "articleDescription": "No discussion shall be held in the State Assembly on any matters that may cause adverse effect on the dispensation of justice on any cases which are sub judice in any courts of Nepal and on any judicial acts done by Judges in the course of performance of their duties."
  },
  {
    "part": "PartFourteen",
    "articleNumber": 192,
    "articleTitle": "Transaction of business in case of vacancy in seat of member",
    "articleDescription": "The State Assembly shall have the power to transact its business notwithstanding any vacancy in the seat of its member; and no proceedings of the State Assembly already conducted shall become invalid even if it is subsequently discovered that a person who was not so entitled took part in such proceedings."
  },
  {
    "part": "PartFourteen",
    "articleNumber": 193,
    "articleTitle": "Power of State Assembly to form committees",
    "articleDescription": "The State Assembly may, in accordance with its rules, form committees or special committees, as required, in order to manage its working procedures."
  },
  {
    "part": "PartFourteen",
    "articleNumber": 194,
    "articleTitle": "Procedures relating to conduct of business of State Assembly",
    "articleDescription": "The State Assembly shall frame rules to conduct its business, maintain order during its meetings and regulate the constitution, functions and procedures of, and other matters relating to, its committees. Until such rules are framed, the State Assembly shall regulate its procedures on its own."
  },
  {
    "part": "PartFourteen",
    "articleNumber": 195,
    "articleTitle": "Secretary and Secretariat of State Assembly",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The Chief of State shall appoint the Secretary of the State Assembly on recommendation of the Speaker of State Assembly."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "There shall be a Secretariat for conducting and managing the business of the State Assembly. The establishment of such Secretariat and other matters related thereto shall be as provided for in the State law."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The qualification, functions, duties, powers and other conditions of service of the Secretary of the State Assembly shall be as provided for in the State law."
      }
    ]
  },
  {
    "part": "PartFourteen",
    "articleNumber": 196,
    "articleTitle": "Remuneration",
    "articleDescription": "The remuneration and facilities of the Speaker and the Deputy Speaker of the State Assembly shall be as provided for in the State law, and as specified by the State Government until such law is made."
  },
  {
    "part": "PartFifteen",
    "articleNumber": 197,
    "articleTitle": "Legislative powers of State Assembly",
    "articleDescription": "The legislative powers of the State Assembly shall be as contained in lists of Schedule-6, Schedule-7 and Schedule-9."
  },
  {
    "part": "PartFifteen",
    "articleNumber": 198,
    "articleTitle": "Procedures for introduction of Bills in State Assembly",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A Bill may, subject to this Constitution, be introduced in the State Assembly."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Money Bill and a Bill concerning peace and security may be introduced only as a Government Bill."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "'Money Bill' means a Bill concerning any or all of the following subjects:",
        "clauseExtraInfo": "Provided that any Bill shall not be deemed to be a Money Bill by the reason only that it provides for the levying of any charges or fees such as license fee, application fee, renewal fee or for the imposition of fines or penalty of imprisonment.",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "the imposition, collection, abolition, remission, alteration or regulation of taxes in the State,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "the preservation of the State Consolidated Fund or any other State Government Fund, the deposit of moneys into and the appropriation or the withdrawal of moneys from such Funds, or the reduction, increment or cancellation of appropriations or of proposed expenditures from such Funds,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "the regulation of matters relating to the borrowing of money or the giving of guarantee by the State Government, or any matter pertaining to the amendment of the law with respect to any financial obligations undertaken or to be undertaken by the State Government,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "the custody and investment of all revenues received by any State Government Fund, moneys acquired through the repayment of loans, and grant moneys; or audits of the accounts of the State Government, or"
          },
          {
            "subClauseLabel": "E",
            "subClauseDescription": "other incidental matters directly related to any of the subjects specified in clause (A), (B), (C) or (D)."
          }
        ]
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "If any question arises whether a Bill is a Money Bill or not, the decision of the Speaker of State Assembly thereon shall be final."
      }
    ]
  },
  {
    "part": "PartFifteen",
    "articleNumber": 199,
    "articleTitle": "Procedures for passage of Bills",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A Bill passed by the State Assembly shall be presented to the Chief of State for assent."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "If a session of the State Assembly terminates while a Bill is under consideration, deliberations on the Bill may continue at the succeeding session.",
        "clauseExtraInfo": "Provided that if the State Assembly is dissolved or its term expires when any Bill is under its consideration, such a Bill shall lapse."
      }
    ]
  },
  {
    "part": "PartFifteen",
    "articleNumber": 200,
    "articleTitle": "Withdrawal of Bills",
    "articleDescription": "A member who has introduced a Bill may, with the approval of the State Assembly, withdraw the Bill."
  },
  {
    "part": "PartFifteen",
    "articleNumber": 201,
    "articleTitle": "Assent on Bills",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A Bill which is to be presented to the Chief of State for assent under Article 199 shall be so presented by the Speaker of State Assembly after it has been certified by him or her.",
        "clauseExtraInfo": "Provided that in the case of a Money Bill, the Speaker of State Assembly shall so certify."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Bill presented to the Chief of State for his or her assent shall be assented to within fifteen days, and the State Assembly shall be informed thereof as soon as possible."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "Except for a Money Bill, if the Chief of State is of the opinion that any Bill needs further deliberations, he or she may send back the Bill with his or her message to the State Assembly within fifteen days from the date of presentation of the Bill to him or her."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "If any Bill is sent back with his or her message by the Chief of State under clause (3), it shall be reconsidered by the State Assembly and if the Bill so reconsidered is again passed as it was or with amendments, and is again presented to him or her, the Chief of State shall give assent to that Bill within fifteen days of such presentation."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "A Bill shall become an Act after the Chief of State gives assent to it."
      }
    ]
  },
  {
    "part": "PartFifteen",
    "articleNumber": 202,
    "articleTitle": "Ordinance",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "If, at any time, except when the State Assembly is in session, a circumstance exists which renders it necessary to take immediate action, the Chief of State may, on the recommendation of the State Council of Ministers, promulgate an Ordinance."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "An Ordinance promulgated under clause (1) shall have the same force and effect as an Act.",
        "clauseExtraInfo": [
          {
            "extraNumber": "A",
            "extraDescription": "Every Ordinance shall be tabled at the session of the State Assembly held after the promulgation, and if not passed by the State Assembly, it shall ipso facto cease to be effective,"
          },
          {
            "extraNumber": "B",
            "extraDescription": "may be repealed at any time by the Chief of State, and"
          },
          {
            "extraNumber": "C",
            "extraDescription": "shall, unless rendered ineffective or repealed under sub-clause (A) or (B), ipso facto cease to be effective at the expiration of sixty days after the day on which a meeting of the State Assembly is held."
          }
        ]
      }
    ]
  },
  {
    "part": "PartSixteen",
    "articleNumber": 203,
    "articleTitle": "No tax to be levied or loan to be raised",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "No tax shall be levied and collected in a State except in accordance with law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "No loan shall be raised and guarantee given by the State Government except as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartSixteen",
    "articleNumber": 204,
    "articleTitle": "State Consolidated Fund",
    "articleDescription": "Except for the revenues of trusts (Guthi), all revenues received by the State Government, all loans raised on the security of revenues, all moneys received in repayment of any loans made under the authority of any State Act and any mounts of grants or loans received from the Government of Nepal shall, except as otherwise provided for in the State Act, be credited to a State Government Fund to be known as the State Consolidated Fund."
  },
  {
    "part": "PartSixteen",
    "articleNumber": 205,
    "articleTitle": "Expenditures from State Consolidated Fund or State Government Fund",
    "articleDescription": "No expenditure shall be incurred out of the State Consolidated Fund or any other State Government Fund except the following:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "moneys charged on the State Consolidated Fund,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "moneys required to meet the expenditure under an Appropriation Act,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "advance moneys authorized by an Act required to meet expenditures, when an Appropriation Bill is under consideration, or"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "expenditures to be incurred in extraordinary circumstances under a Vote of Credit Act which contains only a description of expenditures.",
        "clauseExtraInfo": "Provided that matters relating to the State Contingency Fund shall be in accordance with Article 212."
      }
    ]
  },
  {
    "part": "PartSixteen",
    "articleNumber": 206,
    "articleTitle": "Expenditures chargeable on State Consolidated Fund",
    "articleDescription": "The expenditures relating to the following matters shall be charged on the State Consolidated Fund, and approval of the State Assembly shall not be required for such expenditures:",
    "clauses": [
      {
        "clauseNumber": "A",
        "clauseDescription": "the amount required as remuneration and facilities payable to the State Speaker and the State Deputy Speaker,"
      },
      {
        "clauseNumber": "B",
        "clauseDescription": "the amount required as remuneration and facilities payable to the Chairperson and members of the State Public Service Commission,"
      },
      {
        "clauseNumber": "C",
        "clauseDescription": "all charges relating to debts for which the State Government is liable,"
      },
      {
        "clauseNumber": "D",
        "clauseDescription": "any sum required to satisfy any judgment or decree made by a court against the State Government, and"
      },
      {
        "clauseNumber": "E",
        "clauseDescription": "any other sum specified by a State law to be chargeable on the State Consolidated Fund."
      }
    ]
  },
  {
    "part": "PartSixteen",
    "articleNumber": 207,
    "articleTitle": "Estimates of revenues and expenditures",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The State Minister for Finance shall, in respect of every financial year, lay before the State Assembly an annual estimate setting out, inter alia, the following matters:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "an estimate of revenues,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "the moneys required to meet the charges on the State Consolidated Fund, and"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "the moneys required to meet the expenditure to be provided for by a State Appropriation Act."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The annual estimate to be laid pursuant to clause (1) shall also be accompanied by a statement of the expenses allocated to every Ministry in the previous financial year and particulars of whether the objectives of the expenses have been achieved."
      }
    ]
  },
  {
    "part": "PartSixteen",
    "articleNumber": 208,
    "articleTitle": "State Appropriation Act",
    "articleDescription": "The moneys required to meet the expenditure to be provided for by any State Appropriation Act shall be specified under appropriate heads in an Appropriation Bill."
  },
  {
    "part": "PartSixteen",
    "articleNumber": 209,
    "articleTitle": "Supplementary estimates",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The State Minister for Finance may lay before the State Assembly a supplementary estimate if it is found in any financial year,-",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "that the sum authorized to be spent for a particular service by the State Appropriation Act for the current financial year is insufficient, or that a need has arisen for expenditures upon some new service not provided for in the State Appropriation Act for that year, or"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "that the expenditures made during that financial year are in excess of the amount authorized by the State Appropriation Act."
          }
        ]
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The sums included in the supplementary estimates shall be specified under the heads in a Supplementary Appropriation Bill."
      }
    ]
  },
  {
    "part": "PartSixteen",
    "articleNumber": 210,
    "articleTitle": "Votes on Account",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Notwithstanding anything contained elsewhere in this Part, a portion of the expenditure estimated for the financial year may, when a State Appropriation Bill is under consideration, be incurred in advance under a State Act."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Vote on Account Bill shall not be introduced until the estimates of revenues and expenditures have been laid in accordance with Article 207, and the sums involved in the Vote on Account shall not exceed one-third of the estimate of expenditures for the financial year."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The expenditures incurred in accordance with the State Vote on Account Act shall be included in the State Appropriation Bill."
      }
    ]
  },
  {
    "part": "PartSixteen",
    "articleNumber": 211,
    "articleTitle": "Votes of Credit",
    "articleDescription": "Notwithstanding anything contained elsewhere in this Part, if owing to an emergency due to natural causes or other reasons, it appears to be impractical or inexpedient in view of the security or interest of the State to specify the details required under clause (1) of Article 207, the State Minister for Finance may lay before the State Assembly a Vote of Credit Bill giving only a statement of expenditures."
  },
  {
    "part": "PartSixteen",
    "articleNumber": 212,
    "articleTitle": "State Contingency Fund",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A State Act may create a Fund to be known as the State Contingency Fund into which shall be paid from time to time such moneys as may be determined by the State Act."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Fund under clause (1) shall be under the control of the State Government. Any unforeseen expenditure may be met out of such Fund by the State Government."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The amount of the expenditure under clause (2) shall be reimbursed as soon as possible by the State Act."
      }
    ]
  },
  {
    "part": "PartSixteen",
    "articleNumber": 213,
    "articleTitle": "Act relating to financial procedures",
    "articleDescription": "Matters relating to the transfer of moneys appropriated by the State Act from one head to another and other financial procedures shall be as provided for in the State Act."
  },
  {
    "part": "PartSeventeen",
    "articleNumber": 214,
    "articleTitle": "Executive power of Local Level",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The executive power of the Local Level shall, pursuant to this Constitution and the Federal law, be vested in the Village Executive or the Municipal Executive."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The local executive power shall be as mentioned in Schedule-8 and Schedule-9."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The responsibility for issuing general directives, controlling and regulating the governance of the Village Body and the Municipality shall, subject to this Constitution and other laws, lie in the Village Executive and the Municipal Executive."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The executive functions of the Village Body and the Municipality shall be performed in the name of the Village Executive and the Municipal Executive."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Any decision or order to be issued in the name of the Village Executive and the Municipal Executive pursuant to clause (4) and other instruments of authorization pertaining thereto shall be authenticated as provided for in the Local law."
      }
    ]
  },
  {
    "part": "PartSeventeen",
    "articleNumber": 215,
    "articleTitle": "Provisions relating to Chairperson and Vice-Chairperson of Village Executive",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a Chairperson of Village Executive in each Village Body. The Village Executive shall be formed under his or her chairpersonship."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Village Executive under clause (1) shall consist of one Vice-Chairperson, Ward Chairperson elected from each Ward and members elected pursuant to clause (4)."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The Chairperson and the Vice-Chairperson shall be elected by the voters residing within the concerned Village Body area by secret ballots on the basis of one person one vote, in accordance with the first past the post electoral system.",
        "clauseExplanation": "For the purposes of this Article, 'Chairperson' and 'Vice-Chairperson' mean the Chairperson and the Vice-Chairperson of the Village Executive."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The members of the Village Executive shall also include four women members elected by the members of the Village Assembly from amongst themselves and two members elected by the Village Assembly from the Dalit or minority communities, in possession of the qualification under clause (5), no later than fifteen days after the final results of the election to the Village Assembly under Article 222."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "A person who has the following qualification shall be qualified to be elected to the office of the Chairperson, Vice-Chairperson, Ward Chairperson and member:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "being a citizen of Nepal,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "having completed the age of twenty one years,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "being a voter whose name is included in the electoral rolls of the Village Body,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "not being disqualified by any law."
          }
        ]
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The term of office of the Chairperson, Vice-Chairperson, Ward Chairperson and member shall be five years after the date of being elected."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "A person who has been elected as the Chairperson for two terms shall not be eligible to be a candidate in an election to the Village Body."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "The office of the Chairperson, Vice-Chairperson, Ward Chairperson or member shall become vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if the Chairperson tenders resignation in writing to the Vice-Chairperson, and if the Vice-Chairperson tenders resignation before the Chairperson,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if his or her term of office expires,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "If the seat falls vacant under clause (7) while the term of office of the Chairperson or Vice-Chairperson still remains for more than one year, the vacancy shall be filled through by-election for the remainder of term."
      }
    ]
  },
  {
    "part": "PartSeventeen",
    "articleNumber": 216,
    "articleTitle": "Provisions relating to Mayor and Deputy Mayor of Municipal Executive",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Each Municipality shall have a Mayor. The Municipal Executive shall be formed under his or her chairpersonship."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The Municipal Executive under clause (1) shall consist of one Deputy Mayor, Ward Chairperson elected from each Ward and members elected pursuant to clause (4)."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The Mayor and the Deputy Mayor shall be elected by the voters residing within the concerned Municipal area by secret ballots on the basis of one person one vote, in accordance with the first past the post electoral system.",
        "clauseExplanation": "For the purposes of this Article, 'Mayor' and 'Deputy Mayor' mean the Mayor and the Deputy Mayor of the Municipal Executive."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "The members of the Municipal Executive shall also include five women members elected by the members of the Municipal Assembly from amongst themselves and three members elected by the Municipal Assembly from the Dalit or minority communities, in possession of the qualification under clause (5), no later than fifteen days after the final results of the election to the Municipal Assembly under Article 223."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "A person who has the following qualification shall be qualified to be elected to the office of the Mayor, Deputy Mayor, Ward Chairperson and member:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "being a citizen of Nepal,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "having completed the age of twenty one years,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "being a voter whose name is included in the electoral rolls of the Municipality,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "not being disqualified by any law."
          }
        ]
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The term of office of the Mayor, Deputy Mayor, Ward Chairperson and member shall be five years after the date of being elected."
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "A person who has been elected as the Mayor for two terms shall not be eligible to be a candidate in an election to the Municipality."
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "The office of the Mayor, Deputy Mayor, Ward Chairperson or Member shall become vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if the Mayor tenders resignation in writing to the Deputy Mayor, and if the Deputy Mayor tenders resignation in writing before the Mayor,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if his or her term of office expires,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 9,
        "clauseDescription": "If the seat falls vacant under clause (8) while the term of office of the Mayor or Deputy Mayor still remains for more than one year, the vacancy shall be filled through by-election for the remainder of term."
      }
    ]
  },
  {
    "part": "PartSeventeen",
    "articleNumber": 217,
    "articleTitle": "Judicial Committee",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a three-member judicial committee to be coordinated by its Vice-Chairperson in the case of a Village Body and by its Deputy Mayor in the case of a Municipality, in order to settle disputes under their respective jurisdictions in accordance with law."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The judicial committee under clause (1) shall consist of two members elected by the members of the Village Assembly or the Municipal Assembly from amongst themselves."
      }
    ]
  },
  {
    "part": "PartSeventeen",
    "articleNumber": 218,
    "articleTitle": "Conduct of business of Village Executive and Municipal Executive",
    "articleDescription": "Allocation and conduct of business of the Village Executive and the Municipal Executive shall be carried out in accordance with the rules approved by the Village Executive and the Municipal Executive, respectively."
  },
  {
    "part": "PartSeventeen",
    "articleNumber": 219,
    "articleTitle": "Other provisions relating to Local Level Executive",
    "articleDescription": "Other provisions relating to the Local Level Executive, except those contained in this Part, shall be as provided for in the Federal law, subject to this Constitution."
  },
  {
    "part": "PartSeventeen",
    "articleNumber": 220,
    "articleTitle": "District Assembly and District Coordination Committee",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "There shall be a District Assembly to make coordination between the Village Bodies and Municipalities within the district."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The District Assembly shall consist of Chairpersons and Vice-Chairpersons of Village Executives, and Mayors and Deputy Mayors of Municipal Executives within the district. The first meeting of the District Assembly shall be held no later than thirty days of the date of final results of the election to the Village Assemblies and the Municipal Assemblies."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "The District Assembly shall elect the District Coordination Committee consisting of a maximum of nine Members including one Chief, one Deputy Chief, at least three women and at least one Dalit or minority. The District Coordination Committee shall discharge all functions required to be discharged by the District Assembly."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "A Member of a Village Assembly or Municipal Assembly within the concerned district shall be eligible to be a candidate for the office of Chief, Deputy Chief or Member of the District Coordination Committee. If elected to the office of Chief, Deputy Chief or Member of the District Coordination Committee, his or her office of Member of Village Assembly or of Municipal Assembly shall ipso facto lapse."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "The term of office of the Chief, Deputy Chief and member of the District Coordination Committee shall be five years after the date of being elected."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "The office of the Chief, Deputy Chief and member of the District Coordination Committee shall become vacant in any of the following circumstances:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "if the Chief tenders resignation in writing before the Deputy Chief, and if the Deputy Chief or member tenders resignation in writing before the Chief,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "if his or her term of office expires,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "if he or she dies."
          }
        ]
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "The functions, duties and powers of the District Assembly shall be as follows:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "to make coordination between the Village Bodies and Municipalities within the district,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "to monitor development and construction works to make balance of such works,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "to make coordination between the Federal and the State Government offices and Village Bodies and Municipalities in the district,"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "to perform other functions as provided for in the State law."
          }
        ]
      },
      {
        "clauseNumber": 8,
        "clauseDescription": "Provisions relating to the conduct of the District Assembly, facilities of Members of the District Coordination Committee and other matters relating to the District Assembly shall be as provided for in the State law."
      }
    ]
  },
  {
    "part": "PartEighteen",
    "articleNumber": 221,
    "articleTitle": "Legislative powers of Local Level",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "The legislative powers of the Local Level shall be vested in the Village Assembly and the Municipal Assembly, subject to this Constitution."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The legislative powers of the Village Assembly and the Municipal Assembly shall be as mentioned in the lists contained in Schedule-8 and Schedule-9."
      }
    ]
  },
  {
    "part": "PartEighteen",
    "articleNumber": 222,
    "articleTitle": "Composition of Village Assembly",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Each Village Body shall have a Village Assembly."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Village Assembly under clause (1) shall consist of the Chairperson and Vice-Chairperson of the Village Executive, Ward Chairpersons, and four members elected from each ward and Members of the Village Executive elected from Dalit and minority communities pursuant to clause (4) of Article 215."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "A Village Assembly to be formed under clause (1) shall have representation of at least two women from each ward."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Each ward of a Village Body under the Federal law shall have a Ward Committee composed of the Ward Chairperson and four members. Such Ward Chairperson and Ward members shall be elected in accordance with the first past the post electoral system."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Every person who has completed the age of eighteen years and whose name is included in the electoral rolls of the Village Body shall have a right to vote as provided for in the Federal law."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "A person who has the following qualification shall be qualified to become a candidate for the office of the Member of the Village Assembly:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "being a citizen of Nepal,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "having completed the age of twenty one years,"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "being his or her name included in the electoral rolls of the Village Body, and"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "not being disqualified by any law."
          }
        ]
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "Matters relating to the election to the Village Assembly and other matters pertaining thereto shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEighteen",
    "articleNumber": 223,
    "articleTitle": "Composition of Municipal Assembly",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "Each Municipality shall have a Municipal Assembly."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "A Municipal Assembly under clause (1) shall consist of the Mayor and the Deputy Mayor of the Municipal Executive, Ward Chairpersons, and four members elected from each Ward and members of the Municipal Executive elected from Dalit or minority communities pursuant to clause (4) of Article 216."
      },
      {
        "clauseNumber": 3,
        "clauseDescription": "A Municipal Assembly to be formed under clause (1) shall have representation of at least two women from each Ward."
      },
      {
        "clauseNumber": 4,
        "clauseDescription": "Each ward of a Municipality shall have a Ward Committee composed of one Ward Chairperson and four members as provided for in the Federal law. Such Ward Chairperson and Ward members shall be elected in accordance with the first past the post electoral system."
      },
      {
        "clauseNumber": 5,
        "clauseDescription": "Every person who has completed the age of eighteen years and whose name is included in the electoral rolls of the Municipality shall have a right to vote as provided for in the Federal law."
      },
      {
        "clauseNumber": 6,
        "clauseDescription": "A person who has the following qualification shall be qualified to be a candidate for the office of member of the Municipal Assembly:",
        "subClauses": [
          {
            "subClauseLabel": "A",
            "subClauseDescription": "being a citizen of Nepal,"
          },
          {
            "subClauseLabel": "B",
            "subClauseDescription": "having completed the age of twenty one years, (C) being his or her name included in the electoral rolls of the Municipality, and"
          },
          {
            "subClauseLabel": "C",
            "subClauseDescription": "being his or her name included in the electoral rolls of the Municipality, and"
          },
          {
            "subClauseLabel": "D",
            "subClauseDescription": "not being disqualified by any law."
          }
        ]
      },
      {
        "clauseNumber": 7,
        "clauseDescription": "Matters relating to the election to the Municipal Assembly and other matters pertaining thereto shall be as provided for in the Federal law."
      }
    ]
  },
  {
    "part": "PartEighteen",
    "articleNumber": 224,
    "articleTitle": "Chairperson and Vice-Chairperson of Village Assembly and Municipal Assembly",
    "articleDescription": "The Chairperson and Vice-Chairperson of a Village Executive and the Mayor and Deputy Mayor of a Municipal Executive shall ipso facto be the Chairperson and Vice-Chairperson of the Village Assembly and the Municipal Assembly, respectively, and perform functions as such."
  },
  {
    "part": "PartEighteen",
    "articleNumber": 225,
    "articleTitle": "Term of Village Assembly and Municipal Assembly",
    "articleDescription": "The term of a Village Assembly and of a Municipal Assembly shall be five years for the date of election. Another Village Assembly and Municipal Assembly shall be elected not later than six months of the expiration of such a term."
  },
  {
    "part": "PartEighteen",
    "articleNumber": 226,
    "articleTitle": "Powers to make law",
    "clauses": [
      {
        "clauseNumber": 1,
        "clauseDescription": "A Village Assembly and a Municipal Assembly may make necessary laws on the matters set forth in the Lists contained in Schedule-8 and Schedule-9."
      },
      {
        "clauseNumber": 2,
        "clauseDescription": "The process for making laws under clause (1) shall be as provided for in the State Law."
      }
    ]
  },
  {
    "part": "PartEighteen",
    "articleNumber": 227,
    "articleTitle": "Other provisions relating to Village Assembly and Municipal Assembly",
    "articleDescription": "Other matters relating to the conduct of business of a Village Assembly and Municipal Assembly, rules of procedures of meetings, formation of committees, conditions in which the office of member falls vacant, facilities receivable by members of the Village Assembly and Municipal Assembly and employees and offices of the Village Body and Municipality shall be as provided for in the State law."
  }
]
